[
    {
        "title": "Spaghetti Bolognese",
        "category": "Western",
        "prepared_by": "Chef Sara",
        "prep_time": "15 mins",
        "cook_time": "45 mins",
        "servings": 4,
        "image": "img/bolognese.jpg",
        "description": "Spaghetti Bolognese is a classic Italian pasta dish made with minced beef, tomatoes, onions, garlic, and herbs simmered into a rich meat sauce. It is typically served over spaghetti and topped with grated Parmesan cheese.",
        "ingredients": "Spaghetti: 400g;Ground Beef: 500g;Onion: 1 large, finely chopped;Garlic: 3 cloves, minced;Carrot: 1, finely diced;Celery: 1 stick, finely diced;Canned Tomatoes: 400g;Tomato Paste: 2 tbsp;Olive Oil: 2 tbsp;Salt: to taste;Black Pepper: to taste;Dried Oregano: 1 tsp;Bay Leaf: 1;Milk: 100ml;Grated Parmesan: for serving;Water: as needed",
        "instructions": "Boil water in a large pot with a pinch of salt;Add spaghetti and cook until al dente according to package instructions;Drain and set aside.\nHeat olive oil in a large pan over medium heat;Add chopped onions and sauté for 3 to 4 minutes until soft.\nAdd garlic, carrots, and celery;Cook for another 4 to 5 minutes until vegetables begin to soften.\nAdd ground beef to the pan;Cook and stir until browned evenly, breaking up lumps with a spoon.\nStir in tomato paste and mix thoroughly;Let it cook for 1 to 2 minutes to enhance flavor.\nPour in canned tomatoes and stir well;Add salt, black pepper, Italian herbs, and bay leaf if using.\nReduce heat to low;Simmer uncovered for 20 to 25 minutes, stirring occasionally, until sauce thickens.\nTaste and adjust seasoning if needed;Remove bay leaf before serving.\nServe sauce over cooked spaghetti;Top with grated Parmesan cheese."
    },
    {
        "title": "Chicken Curry",
        "category": "Indian",
        "prepared_by": "Chef Rahman",
        "prep_time": "20 mins",
        "cook_time": "40 mins",
        "servings": 4,
        "image": "img/chickencurry.jpg",
        "description": "Chicken Curry is a flavorful dish made by simmering chicken in a spiced gravy of onions, garlic, ginger, tomatoes, and a blend of aromatic spices. It's often enjoyed with rice or flatbread.",
        "ingredients": "Chicken (cut into pieces): 1kg; Curry Powder: 3 tbsp; Coconut Milk: 400ml; Onion (sliced): 2; Garlic (minced): 3 cloves; Ginger (grated): 1 inch piece; Cooking Oil: 2 tbsp; Water: 200ml (optional, for thinner gravy); Salt: to taste",
        "instructions": "Heat oil in a large pot over medium heat; Add sliced onions and sauté for 3 to 4 minutes until soft and translucent; Add minced garlic and grated ginger; Stir and cook for another 2 minutes until aromatic;\nAdd chicken pieces into the pot; Stir to coat with the onion mixture; Cook for about 5 to 7 minutes until the chicken starts to brown on all sides;\nSprinkle curry powder evenly over the chicken; Stir thoroughly to coat the chicken with the curry powder; Cook for 2 to 3 minutes to allow the spices to release their aroma;\nPour in the coconut milk; Stir well to combine all ingredients and bring the mixture to a gentle boil;\nLower the heat to a simmer; Cover the pot with a lid and let it cook for 20 to 25 minutes, stirring occasionally; If the curry is too thick, add water gradually to achieve desired consistency;\nTaste the curry and add salt as needed; Continue simmering uncovered for another 5 to 10 minutes until the chicken is tender and the sauce thickens slightly;\nTurn off the heat; Let it rest for a few minutes before serving."
    },
    {
        "title": "Pancakes",
        "category": "Western",
        "prepared_by": "Chef Sara",
        "prep_time": "10 mins",
        "cook_time": "20 mins",
        "servings": 3,
        "image": "img/pancake.jpg",
        "description": "Pancakes are thin, fluffy cakes made from a batter of flour, eggs, milk, and butter, cooked on a griddle. Theyre typically served with syrup, fruit, or whipped cream for breakfast or dessert.",
        "ingredients": "All-purpose flour: 1 cup;Milk: 1 cup;Egg: 1 large;Sugar: 2 tbsp;Baking powder: 2 tsp;Salt: 1/4 tsp;Butter (melted): 2 tbsp;Vanilla extract (optional): 1 tsp;Butter or oil (for cooking): as needed",
        "instructions": "In a mixing bowl, combine flour, sugar, baking powder, and salt;In another bowl, whisk together the milk, egg, melted butter, and vanilla extract;Pour the wet ingredients into the dry ingredients and stir just until combined. The batter should be slightly lumpy but with no dry flour;Preheat a non-stick pan or griddle over medium heat and lightly grease with butter or oil;Pour about 1/4 cup of batter onto the pan for each pancake. Let it spread naturally into a round shape;Cook until bubbles form on the surface and the edges look set. This usually takes 2 to 3 minutes;Flip the pancake gently and cook the other side until golden brown, about 1 to 2 minutes more;Remove from the pan and keep warm. Repeat with the remaining batter;Serve pancakes warm with your favorite toppings such as maple syrup, fruits, or butter"
    },
    {
        "title": "Sushi Rolls",
        "category": "Japanese",
        "prepared_by": "Chef Jiro",
        "prep_time": "15 mins",
        "cook_time": "40 mins",
        "servings": 3,
        "image": "img/sushi_rolls.jpg",
        "description": "Sushi Rolls (Makizushi) are a popular Japanese dish consisting of vinegared rice, raw or cooked seafood, and vegetables wrapped in seaweed (nori). Theyre sliced into bite-sized pieces and often served with soy sauce, wasabi, and pickled ginger.",
        "ingredients": "Sushi Rice: 2 cups (uncooked);Water: 2¼ cups;Rice Vinegar: ¼ cup;Sugar: 2 tbsp;Salt: 1 tsp;Nori Sheets: 5;Cucumber: 1, julienned;Carrot: 1, julienned;Avocado: 1, sliced;Imitation Crab Sticks: 5 to 6;Soy Sauce: for serving;Wasabi: optional;Pickled Ginger: optional;Bamboo Sushi Mat: 1 (wrapped in plastic)",
        "instructions": "Rinse the sushi rice under cold water until water runs clear;\nAdd rice and 2¼ cups water to a pot, bring to boil, then cover and simmer on low for 18 to 20 minutes;\nTurn off heat and let rice sit, covered, for 10 minutes;\nIn a small bowl, mix rice vinegar, sugar, and salt until dissolved;\nTransfer rice to a wide bowl, pour vinegar mixture over, and gently fold rice to cool and coat evenly;\nPlace a sheet of nori, shiny side down, on the bamboo mat;\nWith wet fingers, spread a thin layer of rice over the nori, leaving 1 inch at the top edge bare;\nArrange a few strips of cucumber, carrot, avocado, and 1 crab stick in a horizontal line near the bottom edge;\nLift the bottom of the mat and roll it tightly over the filling, pressing gently but firmly to shape;\nContinue rolling until the exposed edge of the nori seals the roll;\nUse a sharp, wet knife to slice the roll into 6 to 8 equal pieces;\nServe with soy sauce, wasabi, and pickled ginger on the side"
    },
    {
        "title": "Chicken Teriyaki",
        "category": "Japanese",
        "prepared_by": "Chef Kenji",
        "prep_time": "10 mins",
        "cook_time": "30 mins",
        "servings": 3,
        "image": "img/chicken_teriyaki.jpg",
        "description": "Chicken Teriyaki features grilled or pan-fried chicken glazed in a sweet-savory sauce made from soy sauce, mirin, and sugar. It is usually served with steamed rice and vegetables.",
        "ingredients": "Chicken Thigh (boneless, skinless): 1kg;Soy Sauce: 150ml;Mirin (Japanese sweet rice wine): 100ml;Sugar: 3 tbsp;Garlic: 3 cloves, minced;Ginger: 1 inch, grated;Cornstarch: 1 tbsp;Water: 2 tbsp (for cornstarch slurry);Sesame Oil: 1 tbsp;Sesame Seeds: 1 tsp (optional garnish);Spring Onion: 1 stalk, chopped (optional garnish);Cooking Oil: 1 tbsp\n",
        "instructions": "Trim excess fat from chicken thighs and cut them into bite-sized pieces;\nIn a bowl, combine soy sauce, mirin, sugar, minced garlic, and grated ginger to make the teriyaki sauce;\nStir well until the sugar is dissolved and set aside;\nHeat 1 tbsp of cooking oil in a large non-stick pan over medium heat;\nAdd the chicken pieces to the pan in a single layer, skin-side down if using skin-on pieces;\nLet the chicken cook undisturbed for 4 to 5 minutes until browned on one side;\nFlip the chicken and cook the other side for another 4 to 5 minutes until nearly cooked through;\nReduce the heat to low and pour the teriyaki sauce mixture into the pan with the chicken;\nLet the sauce simmer with the chicken, turning the chicken occasionally to coat it evenly;\nIn a small bowl, mix cornstarch with 2 tbsp of water to create a slurry;\nOnce the sauce starts to bubble, add the slurry to the pan and stir gently;\nCook for another 2 to 3 minutes until the sauce thickens and glazes the chicken nicely;\nDrizzle with sesame oil for extra aroma;\nTurn off the heat and let the chicken sit in the sauce for a minute to soak in more flavor;\nServe hot, garnished with sesame seeds and chopped spring onion if desired;\nBest enjoyed over steamed rice or with stir-fried vegetables."
    },
    {
        "title": "Miso Soup",
        "category": "Japanese",
        "prepared_by": "Chef Kenji",
        "prep_time": "20 mins",
        "cook_time": "1 hour",
        "servings": 5,
        "image": "img/miso_soup.jpg",
        "description": "A comforting traditional miso-based soup. Broth-based soup with miso paste, tofu, and seaweed.",
        "ingredients": "Water: 4 cups;\nDashi powder (instant soup stock): 1 tsp;\nMiso paste: 3 tbsp;\nTofu (firm or silken): 100g, cut into small cubes;\nGreen onions: 2 stalks, thinly sliced;\nWakame seaweed (dried): 1 tbsp",
        "instructions": "Bring water to a gentle boil in a medium saucepan; Add dashi powder and stir until dissolved; Reduce heat to low to keep the broth warm but not boiling; Place miso paste in a small bowl, add a few tablespoons of warm broth, and whisk until smooth; Slowly pour the miso mixture back into the saucepan while stirring gently; Add tofu cubes and dried wakame seaweed into the soup; Simmer for about 2-3 minutes, allowing the tofu to warm and wakame to rehydrate; Turn off the heat before the soup boils to preserve misos flavor; Ladle soup into bowls and sprinkle sliced green onions on top before serving."
    },
    {
        "title": "Tempura",
        "category": "Japanese",
        "prepared_by": "Chef Jiro",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 6,
        "image": "img/tempura.jpg",
        "description": "Japanese dish of seafood or vegetables lightly battered and deep-fried until crispy. It is served with a dipping sauce made of soy sauce, dashi, and mirin.",
        "ingredients": "Shrimp (peeled and deveined): 300g;\nAll-purpose flour: 1 cup;\nCornstarch: ¼ cup;\nEgg: 1;\nIce-cold water: 1 cup;\nBaking powder: 1 tsp;\nSalt: ½ tsp;\nVegetable oil (for frying): enough to deep fry;\nOptional vegetables (sweet potato, bell pepper, green beans): sliced thinly",
        "instructions": "Prepare all ingredients and dry shrimp and vegetables thoroughly;\nIn a bowl, lightly beat the egg;\nAdd ice-cold water to the beaten egg; mix gently but do not overbeat;\nIn a separate bowl, sift together flour, cornstarch, baking powder, and salt;\nAdd the dry ingredients to the egg mixture slowly; mix lightly with chopsticks or a fork just until combined; lumps are okaydo not overmix or batter will be dense;\nHeat oil in a deep pan or fryer to 170-180°C (340-360°F);\nDip shrimp and vegetables into the batter, ensuring they are fully coated;\nCarefully place battered items into the hot oil one by one; do not overcrowd the pan;\nFry until the tempura turns light golden and crispy, about 2-3 minutes;\nRemove with a slotted spoon and drain on paper towels;\nServe immediately with tempura dipping sauce or soy sauce"
    },
    {
        "title": "Tonkatsu",
        "category": "Japanese",
        "prepared_by": "Chef Seiji",
        "prep_time": "25 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/tonkatsu.jpg",
        "description": "breaded, deep-fried pork cutlet popular in Japan. It is served with shredded cabbage and a tangy tonkatsu sauce.",
        "ingredients": "Pork loin chops: 4 (about 150-200g each);Salt: 1 tsp;Black pepper: 1/2 tsp;All-purpose flour: 1/2 cup;Eggs: 2, beaten;Panko breadcrumbs: 1 cup;Vegetable oil: for frying;Tonkatsu sauce: for serving;Shredded cabbage: for serving;Lemon wedges: optional",
        "instructions": "Pat pork chops dry and season both sides with salt and pepper;Prepare three shallow dishes: one with flour, one with beaten eggs, and one with panko breadcrumbs;Dredge each pork chop in flour, shaking off excess;Dip into beaten eggs fully coating;Press into panko breadcrumbs firmly to cover evenly;Heat about 1 inch of vegetable oil in a deep pan over medium heat until it reaches 170-180°C (340-360°F);Carefully place the breaded pork chops in the hot oil without overcrowding;Fry each side for about 4-5 minutes or until golden brown and cooked through;Use tongs to turn gently and maintain even cooking;Remove chops and drain on paper towels;Slice tonkatsu into strips;Serve immediately with tonkatsu sauce drizzled on top, shredded cabbage, and lemon wedges if desired."
    },
    {
        "title": "Ramen",
        "category": "Japanese",
        "prepared_by": "Chef Seiji",
        "prep_time": "10 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/ramen.jpg",
        "description": "Noodles in a rich, savory broth often flavored with soy or miso, and topped with meat, eggs, and vegetables.",
        "ingredients": "Chicken broth: 1.5 liters;\nSoy sauce: 4 tbsp;\nMiso paste: 2 tbsp;\nSesame oil: 1 tbsp;\nGarlic: 3 cloves, minced;\nGinger: 1 inch, minced;\nRamen noodles: 300g;\nChicken breast: 200g, thinly sliced;\nGreen onions: 3, chopped;\nSoft-boiled eggs: 2;\nMushrooms (shiitake or button): 100g, sliced;\nCorn kernels: 100g;\nNori (seaweed sheets): 2, cut into strips;\nSalt: to taste;\nPepper: to taste",
        "instructions": "Heat sesame oil in a large pot over medium heat; add minced garlic and ginger and sauté until fragrant, about 1-2 minutes;\nPour in chicken broth and bring to a gentle boil; reduce heat to low and stir in soy sauce and miso paste until dissolved;\nAdd sliced mushrooms and corn kernels to the broth; simmer for 5 minutes to allow flavors to meld;\nMeanwhile, cook ramen noodles in a separate pot according to package instructions until just tender; drain and set aside;\nIn the simmering broth, add thinly sliced chicken breast; cook gently until chicken is fully cooked through, about 5 minutes;\nSeason broth with salt and pepper to taste;\nDivide cooked noodles into serving bowls; ladle hot broth with chicken, mushrooms, and corn over the noodles;\nTop each bowl with halved soft-boiled eggs, chopped green onions, and nori strips;\nServe immediately and enjoy your hearty, flavorful ramen!"
    },
    {
        "title": "Okonomiyaki",
        "category": "Japanese",
        "prepared_by": "Chef Nobu",
        "prep_time": "20 mins",
        "cook_time": "15 mins",
        "servings": 4,
        "image": "img/okonomiyaki.jpg",
        "description": "Savory Japanese pancake with various toppings like pork, shrimp, or cheese, drizzled with mayo and okonomiyaki sauce.",
        "ingredients": "All-purpose flour: 1 cup;\nDashi stock or water: 3/4 cup;\nEggs: 2;\nCabbage: 2 cups, finely shredded;\nGreen onions: 3 stalks, chopped;\nTenkasu (tempura bits): 1/4 cup (optional);\nThinly sliced pork belly or bacon: 6 slices;\nOkonomiyaki sauce: to taste;\nJapanese mayonnaise: to taste;\nAonori (seaweed flakes): 1 tbsp;\nKatsuobushi (bonito flakes): 1 tbsp;\nPickled ginger (beni shoga): 2 tbsp (optional);\nVegetable oil: 2 tbsp;\nSalt: a pinch",
        "instructions": "In a large bowl, mix flour and dashi stock (or water) until smooth batter forms;Add eggs and whisk thoroughly to combine;Add shredded cabbage, chopped green onions, tenkasu, and a pinch of salt to the batter;Mix everything gently until well incorporated;Heat a non-stick frying pan over medium heat and add a tablespoon of vegetable oil;Pour half of the batter into the pan and spread it evenly into a round pancake about 7-8 inches in diameter;Lay 3 slices of pork belly evenly on top of the batter;Cook for about 4-5 minutes until the bottom is golden brown and the edges start to set;Carefully flip the okonomiyaki using a spatula, making sure the pork side is now on the bottom;Press down lightly and cook for another 4-5 minutes until the pork is cooked through and the pancake is firm;Flip again if needed to ensure both sides are evenly cooked;Transfer the okonomiyaki to a plate;Brush a generous amount of okonomiyaki sauce on top;Drizzle Japanese mayonnaise in a zigzag pattern over the sauce;Sprinkle aonori and katsuobushi flakes evenly on top;Add pickled ginger on the side if using;Repeat the steps for the second okonomiyaki with remaining ingredients;Serve hot and enjoy!"
    },
    {
        "title": "Gyudon",
        "category": "Japanese",
        "prepared_by": "Chef Nobu",
        "prep_time": "15 mins",
        "cook_time": "1 hour",
        "servings": 3,
        "image": "img/gyudon.jpg",
        "description": "Rice bowl topped with thinly sliced beef and onions simmered in a sweet and savory soy-based sauce, often served with a raw or poached egg.",
        "ingredients": "Thinly sliced beef (ribeye or chuck): 300g; Onion: 1 medium, thinly sliced; Dashi stock: 200ml; Soy sauce: 3 tbsp; Mirin: 3 tbsp; Sake: 2 tbsp; Sugar: 1 tbsp; Cooked Japanese short-grain rice: 2 bowls; Pickled ginger (beni shoga): to serve; Green onions, chopped: for garnish; Optional: Soft boiled egg or raw egg yolk for topping",
        "instructions": "Prepare the dashi stock or use instant dashi powder dissolved in water; In a medium pan, combine dashi, soy sauce, mirin, sake, and sugar; Bring the mixture to a gentle boil over medium heat, stirring to dissolve the sugar; Add the sliced onions and cook until they become translucent and soft, about 5-7 minutes; Add the thinly sliced beef to the pan, spreading it out evenly; Cook the beef gently in the simmering sauce, stirring occasionally until the meat is just cooked through, about 3-4 minutes; Taste the sauce and adjust seasoning if needed, adding a little more soy sauce or sugar if desired; Remove from heat; To serve, divide the hot steamed rice into bowls; Spoon the beef and onion mixture generously over the rice along with some of the sauce; Garnish with chopped green onions and a small amount of pickled ginger; Optionally, top each bowl with a soft boiled egg or raw egg yolk for extra richness"
    },
    {
        "title": "Onigiri",
        "category": "Japanese",
        "prepared_by": "Chef Yoshihiro ",
        "prep_time": "25 mins",
        "cook_time": "15 mins",
        "servings": 4,
        "image": "img/onigiri.jpg",
        "description": "Rice balls shaped by hand, often wrapped in seaweed and filled with savory ingredients like pickled plum, salmon, or tuna mayo.",
        "ingredients": "Japanese short-grain rice: 2 cups; Water: 2.5 cups; Salt: 1 tsp; Nori (seaweed) sheets: 3-4, cut into strips; Filling (choose one): salted salmon flakes, tuna mayo, pickled plum (umeboshi), or cooked seasoned vegetables",
        "instructions": "Rinse the rice under cold water until water runs clear; Drain and soak rice in water for 30 minutes; Cook rice with water in a rice cooker or pot; When cooked, let rice rest covered for 10 minutes; Wet your hands with water and rub a pinch of salt on your palms; Take a handful of rice and flatten it slightly; Place 1 tsp of your chosen filling in the center; Mold the rice around the filling into a triangular or oval shape; Press gently but firmly to keep shape; Wrap a strip of nori around the bottom or side of the rice ball; Serve immediately or wrap in plastic wrap to keep fresh until eating."
    },
    {
        "title": "Udon Soup",
        "category": "Japanese",
        "prepared_by": "Chef Yoshihiro ",
        "prep_time": "20 mins",
        "cook_time": "15 mins",
        "servings": 6,
        "image": "img/udon_soup.jpg",
        "description": "Udon Soup features thick, chewy Japanese udon noodles served in a mild broth made from dashi, soy sauce, and mirin, often topped with tempura, vegetables, or meat.",
        "ingredients": "Udon noodles (fresh or frozen): 300g; Dashi stock (or water with dashi powder): 4 cups; Soy sauce: 3 tbsp; Mirin: 2 tbsp; Sake: 1 tbsp; Sugar: 1 tsp; Green onions: 2, sliced; Shiitake mushrooms: 4, sliced; Tofu (optional): 150g, cubed; Wakame seaweed (optional): 1 tbsp; Salt: to taste",
        "instructions": "Prepare the dashi stock by heating 4 cups of water and adding dashi powder if not using ready-made stock;Bring the dashi stock to a gentle simmer over medium heat;Add soy sauce, mirin, sake, and sugar to the simmering stock;Stir the broth well to dissolve the sugar and mix the seasonings evenly;Add sliced shiitake mushrooms and tofu cubes to the broth;Simmer the broth for 5 to 7 minutes until mushrooms are tender and tofu is heated through;Meanwhile, cook the udon noodles separately according to package instructions until they are just tender;Drain the noodles well and divide them into serving bowls;Add optional wakame seaweed to the broth and simmer for another minute;Pour the hot broth with mushrooms and tofu over the noodles in each bowl;Garnish with sliced green onions on top and add salt if needed;Serve immediately while hot."
    },
    {
        "title": "Nasi Lemak",
        "category": "Malay",
        "prepared_by": "Chef Khairul Aming",
        "prep_time": "10 mins",
        "cook_time": "40 mins",
        "servings": 3,
        "image": "img/nasi_lemak.jpg",
        "description": "Malaysias national dish made of coconut rice served with sambal, fried anchovies, boiled egg, cucumber, and peanuts. It is often accompanied by fried chicken or rendang.",
        "ingredients": "Rice: 2 cups;Coconut Milk: 400 ml;Water: 300 ml;Pandan Leaves: 2, knotted;Salt: 1 tsp\nIkan Bilis (Dried Anchovies): 1 cup;Peanuts: 1/2 cup;Cucumber: 1, sliced;Eggs: 4, boiled\nOil: 4 tbsp\nOnion: 1 large, thinly sliced;Garlic: 3 cloves, minced;Ginger: 1 inch, minced\nDried Chilies: 10, soaked and blended;Shallots: 5, blended;Tamarind Paste: 1 tbsp;Sugar: 1 tbsp;Salt: to taste\n",
        "instructions": "Rinse the rice until the water runs clear;Place rice in a rice cooker with coconut milk, water, pandan leaves, and salt;Stir to combine and cook as usual until done.\nHeat 2 tbsp of oil in a pan;Fry the dried anchovies until crispy;Remove and set aside.\nIn the same pan, add peanuts;Toast them over low heat until golden brown;Remove and set aside.\nBoil the eggs for 10 minutes;Cool in cold water and peel;Slice each egg in half.\nHeat 2 tbsp of oil in a saucepan;Add sliced onions, garlic, and ginger;Sauté until fragrant and soft.\nAdd blended dried chilies and shallots;Cook over medium heat for 5 to 7 minutes until oil separates from the paste.\nStir in tamarind paste, sugar, and salt;Simmer for another 3 to 5 minutes until the sambal thickens slightly;Adjust seasoning to taste.\nTo serve, place a scoop of coconut rice on a plate;Add sambal, fried anchovies, peanuts, sliced cucumber, and half a boiled egg on the side."
    },
    {
        "title": "Rendang",
        "category": "Malay",
        "prepared_by": "Chef Khairul Aming",
        "prep_time": "10 mins",
        "cook_time": "40 mins",
        "servings": 5,
        "image": "img/rendang.jpg",
        "description": "Slow-cooked dry curry featuring beef simmered in coconut milk and a spice paste until tender and deeply flavorful.",
        "ingredients": "Beef (cubed): 1kg;Coconut Milk: 400ml;Desiccated Coconut (kerisik): 3 tbsp;Shallots: 10, peeled and sliced;Garlic: 5 cloves;Ginger: 2 inches;Galangal: 1 inch;Lemongrass: 2 stalks, white part only, smashed;Dried Chilies (soaked and blended): 10;Turmeric Leaf: 1, shredded (optional);Kaffir Lime Leaves: 5;Tamarind Juice: 2 tbsp;Palm Sugar: 1 tbsp;Salt: to taste;Cooking Oil: 4 tbsp",
        "instructions": "Blend shallots, garlic, ginger, galangal, and soaked dried chilies into a smooth paste;Heat oil in a large wok or pot over medium heat;Add the blended spice paste and sauté until fragrant and oil begins to separate from the paste, about 10 to 15 minutes;Add the lemongrass, kaffir lime leaves, and turmeric leaf, then stir for 2 to 3 minutes;Add the beef cubes and stir to coat them evenly in the spice mixture;Pour in the coconut milk and tamarind juice, then bring the mixture to a boil;Lower the heat and simmer uncovered, stirring occasionally to prevent sticking, for about 1 hour;Add the desiccated coconut (kerisik) and palm sugar, then continue to cook on low heat;Stir often and reduce the sauce until it becomes thick and the oil rises to the top;Season with salt to taste and continue cooking until the beef is fork-tender and the rendang is dry and dark brown in color;Remove from heat and let it sit for a few minutes before serving."
    },
    {
        "title": "Satay",
        "category": "Malay",
        "prepared_by": "Chef Liyana",
        "prep_time": "25 mins",
        "cook_time": "15 mins",
        "servings": 4,
        "image": "img/satay.jpg",
        "description": "Southeast Asian dish of marinated meat skewers grilled over open flame, served with a rich peanut sauce and sometimes with rice cakes and cucumber.",
        "ingredients": "Chicken thigh (boneless, skinless): 1kg, cut into small cubes;Lemongrass: 2 stalks, finely chopped (white part only);Garlic: 4 cloves, minced;Shallots: 6, minced;Ginger: 1 inch, grated;Turmeric powder: 1 tsp;Coriander powder: 1 tbsp;Cumin powder: 1 tsp;Brown sugar: 2 tbsp;Soy sauce: 2 tbsp;Salt: 1 tsp;Oil: 2 tbsp;Bamboo skewers: 20 sticks (soaked in water 30 mins before use)",
        "instructions": "Prepare the marinade by blending lemongrass, garlic, shallots, and ginger into a paste using a food processor or mortar and pestle;Transfer the paste to a large bowl and add turmeric powder, coriander powder, cumin powder, brown sugar, soy sauce, salt, and oil;Mix everything thoroughly until it becomes a thick, fragrant marinade;Add the chicken cubes into the marinade and stir well to coat each piece evenly;Cover the bowl and marinate the chicken in the refrigerator for at least 4 hours, preferably overnight for better flavor absorption;Thread the marinated chicken pieces onto the soaked bamboo skewers, packing them snugly but not too tight;Preheat a grill or grill pan over medium-high heat and lightly oil the surface to prevent sticking;Grill the satay skewers in batches, turning every 2 to 3 minutes to ensure even cooking;Brush the skewers occasionally with leftover marinade or oil to keep them moist;Grill until the chicken is cooked through and slightly charred at the edges, about 10 to 12 minutes in total per batch;Serve hot with peanut sauce, cucumber slices, and compressed rice (nasi impit)"
    },
    {
        "title": "Mee Goreng",
        "category": "Malay",
        "prepared_by": "Chef Aina",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/mee_goreng.jpg",
        "description": "Spicy stir-fried noodles with vegetables and meat.",
        "ingredients": "Yellow noodles: 400g;Chicken breast (sliced thin): 200g;Prawns (peeled and deveined): 100g;Firm tofu (cubed): 100g;Garlic: 3 cloves, minced;Shallots: 2, sliced thinly;Eggs: 2;Choy sum or cabbage: 1 cup, chopped;Tomato: 1, cut into wedges;Bean sprouts: 1 cup;Soy sauce: 2 tbsp;Dark soy sauce: 1 tbsp;Chili paste: 1 tbsp;Sweet soy sauce (kicap manis): 1 tbsp;Salt: to taste;Oil: 3 tbsp;Lime: 1, cut into wedges",
        "instructions": "Heat 2 tbsp of oil in a large wok over medium heat;Add sliced shallots and minced garlic;Sauté for 1 to 2 minutes until fragrant and golden.\nAdd tofu cubes;Fry until all sides are golden brown;Push to the side of the wok.\nAdd chicken slices and cook for 3 to 4 minutes until browned;Add prawns and stir-fry until they turn pink and are just cooked through.\nPush everything to the side;Crack in the eggs;Let them set slightly before scrambling and mixing with other ingredients.\nAdd chili paste;Stir-fry for 1 minute to bring out the aroma.\nAdd yellow noodles;Use tongs or two spatulas to toss and combine thoroughly with the rest of the ingredients.\nPour in soy sauce, dark soy sauce, and sweet soy sauce;Mix well so noodles are evenly coated and darkened in color.\nAdd chopped choy sum or cabbage and tomato wedges;Stir-fry until vegetables are tender-crisp and tomatoes slightly softened.\nAdd bean sprouts;Toss briefly to keep them crunchy.\nSeason with salt to taste;Drizzle remaining 1 tbsp oil around the edges and give everything a final toss.\nTurn off heat;Serve hot with a wedge of lime on the side for squeezing.\n"
    },
    {
        "title": "Ayam Masak Merah",
        "category": "Malay",
        "prepared_by": "Chef Aisyah",
        "prep_time": "15 mins",
        "cook_time": "15 mins",
        "servings": 4,
        "image": "img/ayam_masak_merah.jpg",
        "description": "Malaysian tomato-based chicken dish where fried chicken is simmered in a spicy tomato gravy with onions, spices, and sometimes peas.",
        "ingredients": "Chicken (cut into medium pieces): 1 kg;Salt: to taste;Turmeric powder: 1 tsp (for marinating);Oil: 5 tbsp (for frying and cooking);Onion: 2 large, sliced;Garlic: 4 cloves;Ginger: 1 inch piece;Tomato sauce: 1 cup;Chili paste: 4 tbsp (adjust to spice preference);Cinnamon stick: 1;Star anise: 1;Cloves: 3;Cardamom pods: 2;Sugar: 1 tbsp;Water: 1 cup;Frozen peas (optional): 1/2 cup;Fried shallots (for garnish): a handful\n",
        "instructions": "Marinate the chicken with salt and turmeric powder;Heat 3 tbsp oil in a pan and shallow-fry the chicken until lightly browned on the outside;Remove and set aside.\nBlend garlic, ginger, and one sliced onion until smooth;Heat 2 tbsp oil in a clean pan, then add the blended paste and cook over medium heat until fragrant and slightly caramelized.\nAdd cinnamon stick, star anise, cloves, and cardamom;Stir for 1 to 2 minutes until the spices release their aroma.\nAdd chili paste and continue stirring;Cook until the oil separates from the paste, indicating that the chili paste is well-cooked.\nPour in tomato sauce and mix well;Add sugar and stir;Cook for about 5 minutes until the sauce thickens slightly.\nReturn the fried chicken to the pan;Add water and mix to coat the chicken evenly with the sauce.\nLower the heat and cover the pan;Simmer for 15 to 20 minutes until the chicken is tender and the sauce has reduced slightly.\nAdd frozen peas if using;Cook for another 5 minutes to heat through.\nTurn off the heat;Garnish with fried shallots before serving."
    },
    {
        "title": "Nasi Kerabu",
        "category": "Malay",
        "prepared_by": "Chef Aina",
        "prep_time": "25 mins",
        "cook_time": "1 hour and 30 mins",
        "servings": 5,
        "image": "img/nasi_kerabu.jpg",
        "description": "Nasi Kerabu is a vibrant Malaysian rice dish featuring blue-colored rice cooked with butterfly pea flowers. It is traditionally served with fresh herbs, toasted coconut, salted egg, spicy sambal, and grilled or fried fish or chicken. This flavorful combination offers a unique blend of floral, spicy, and savory tastes, making it a beloved delicacy from the east coast of Malaysia.",
        "ingredients": "Blue rice (cooked with butterfly pea flower): 4 cups;Grated coconut (fresh): 1 cup;Shredded kaffir lime leaves: 3 leaves;Salt: to taste;Lemongrass (chopped finely): 2 stalks;Dry-fried fish or grilled chicken: 1 whole or 4 pieces;Sambal (spicy sauce): ½ cup;Fresh herbs (daun kesum, daun selom, bean sprouts, long beans  to  finely sliced): 1 cup total;Salted egg (halved): 2 eggs;Keropok (fish crackers): a handful;Torch ginger bud (bunga kantan, sliced): ½ bud",
        "instructions": "Cook the rice with butterfly pea flowers until soft and evenly blue;Fluff the rice and keep warm.\nToast grated coconut in a dry pan over medium heat until golden brown and aromatic;Remove from heat and let cool slightly.\nPound or blend the toasted coconut with salt, lemongrass, and shredded kaffir lime leaves to make kerisik;Mix well and set aside.\nGrill or fry fish or chicken until fully cooked and crispy on the outside;Set aside to serve later.\nPrepare sambal by blending chilies, garlic, onion, and shrimp paste;Cook the mixture in oil until fragrant and thick;Season with salt and sugar to balance the heat.\nThinly slice all fresh herbs and vegetables;Mix them gently to create the fresh ulam (herb salad).\nSlice the salted eggs into halves;Fry the fish crackers until crispy if not already done.\nTo serve, place blue rice on a plate;Top with toasted coconut mixture (kerisik), herb salad, grilled meat or fish, sambal, half a salted egg, and keropok;Garnish with sliced bunga kantan for fragrance."
    },
    {
        "title": "Sambal Udang",
        "category": "Malay",
        "prepared_by": "Chef Wan",
        "prep_time": "20 mins",
        "cook_time": "40 mins",
        "servings": 2,
        "image": "img/sambal_udang.jpg",
        "description": "Malaysian prawn dish cooked in a spicy sambal chili paste, often combined with tamarind juice for a tangy kick.",
        "ingredients": "Prawns (medium to large, peeled and deveined): 500g;Dried Chilies: 20 pieces (soaked in hot water);Shallots: 6;Garlic: 4 cloves;Tamarind paste: 1 tbsp (mixed with 3 tbsp water);Sugar: 1 tbsp;Salt: to taste;Oil: 3 tbsp;Onion: 1, sliced;Belacan (fermented shrimp paste): 1 tsp (optional);Water: 50ml",
        "instructions": "Blend dried chilies, shallots, and garlic into a smooth paste;Heat oil in a pan over medium heat and sauté the chili paste until fragrant and the oil separates, about 10-12 minutes;Add belacan and continue to sauté for another 2-3 minutes until well mixed;Add sliced onion and cook until slightly soft;Add tamarind juice, sugar, and salt;Stir well and let the sambal simmer for 3-4 minutes;Add prawns and stir to coat them evenly with the sambal;Pour in water and let the prawns cook until they turn pink and are fully cooked, about 5-7 minutes;Taste and adjust seasoning as needed;Turn off the heat and serve hot with rice\n"
    },
    {
        "title": "Lontong",
        "category": "Malay",
        "prepared_by": "Chef Wan",
        "prep_time": "20 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/lontong.jpg",
        "description": "Festive Malaysian and Indonesian dish featuring compressed rice cakes served with coconut milk-based vegetable curry and sometimes boiled eggs or sambal.",
        "ingredients": "Rice cake (Lontong), sliced: 300g;\nCoconut milk: 400ml;\nLong beans (cut into 2-inch pieces): 100g;\nCabbage (chopped): 150g;\nCarrot (sliced): 1 medium;\nTofu (fried and cut into cubes): 150g;\nShallots: 5, peeled and sliced;\nGarlic: 3 cloves, peeled and sliced;\nCandlenuts: 3, ground;\nTurmeric powder: 1 tsp;\nGalangal (sliced): 2 inches;\nLemongrass (bruised): 1 stalk;\nRed chili (optional, sliced): 1;\nSalt: to taste;\nSugar: 1 tsp;\nWater: 500ml;\nOil: 3 tbsp",
        "instructions": "Heat oil in a pot over medium heat; sautée shallots and garlic until fragrant and translucent; add ground candlenuts, turmeric powder, and continue stirring for about 2 minutes to release aroma;\nAdd galangal, bruised lemongrass, and sliced red chili; stir briefly; pour in water and bring to a gentle boil;\nAdd carrot and long beans; cook for 5 minutes until slightly tender but still crisp;\nPour in coconut milk slowly, stirring to combine; bring the mixture back to a gentle simmer;\nAdd chopped cabbage and fried tofu cubes; season with salt and sugar; stir gently to avoid breaking the coconut milk;\nSimmer for another 7 to 10 minutes, stirring occasionally; make sure vegetables are cooked but still hold their shape;\nRemove lemongrass and galangal slices; check seasoning and adjust salt or sugar if needed;\nServe hot with sliced lontong (rice cake) on the side or in the soup; garnish with fried shallots if desired."
    },
    {
        "title": "Kerabu Mangga",
        "category": "Malay",
        "prepared_by": "Chef Liyana",
        "prep_time": "25 mins",
        "cook_time": "15 mins",
        "servings": 4,
        "image": "img/kerabu_mangga.jpg",
        "description": "Spicy, tangy Thai-inspired mango salad from Malaysia made with shredded green mango, chili, lime, and toasted peanuts or dried shrimp.",
        "ingredients": "Raw green mango (shredded): 2 medium;\nRed chili (thinly sliced): 2;\nShallots (thinly sliced): 3;\nFresh coriander leaves (chopped): 2 tbsp;\nPeanuts (roasted and roughly crushed): 1/4 cup;\nDried shrimp (optional, toasted and crushed): 2 tbsp;\nLime juice: 3 tbsp;\nFish sauce or soy sauce: 2 tbsp;\nSugar (palm sugar preferred): 1 tbsp;\nSalt: a pinch;\nFresh mint leaves (optional): a few sprigs",
        "instructions": "Peel the green mango and shred it finely using a grater or knife; place in a large mixing bowl and set aside.\nSlice the shallots and red chilies very thinly; add them to the bowl with the shredded mango.\nChop the fresh coriander leaves roughly and add into the bowl.\nIf using dried shrimp, toast them lightly in a dry pan until fragrant, then crush roughly and add to the bowl.\nIn a small bowl, combine lime juice, fish sauce (or soy sauce), sugar, and a pinch of salt; stir well until the sugar dissolves completely to make the dressing.\nPour the dressing over the mango mixture; toss everything together gently but thoroughly so that the mango and other ingredients are evenly coated with the dressing.\nAdd the roasted peanuts and fresh mint leaves; give a final gentle toss to mix.\nTaste the salad and adjust seasoning with more lime juice, sugar, or salt as needed.\nServe immediately for the freshest taste or chill for 10-15 minutes to let the flavors meld before serving."
    },
    {
        "title": "Bubur Lambuk",
        "category": "Malay",
        "prepared_by": "Chef Liyana",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 2,
        "image": "img/bubur_lambuk.jpg",
        "description": "Malaysian porridge dish made with rice, spices, coconut milk, and meat, commonly enjoyed during Ramadan as a hearty iftar meal.",
        "ingredients": "Rice: 1 cup;\nBeef (cut into small cubes): 200g;\nWater: 6 cups;\nOnion (finely chopped): 1 medium;\nGarlic (minced): 4 cloves;\nGinger (thinly sliced): 1 inch piece;\nShallots (thinly sliced): 3;\nLemongrass (bruised): 1 stalk;\nCurry powder: 1 tbsp;\nCoriander powder: 1 tsp;\nCumin powder: 1 tsp;\nChili powder (optional): ½ tsp;\nCoconut milk: 200 ml;\nCooking oil: 2 tbsp;\nSalt: to taste;\nSugar: 1 tsp;\nFried shallots: for garnish;\nFresh chopped cilantro or daun sup: for garnish;\nLime wedges: for serving (optional);",
        "instructions": "Rinse the rice until water runs clear; soak for 15 minutes then drain;Heat oil in a large pot over medium heat; add onions, garlic, ginger, shallots, and lemongrass; sauté gently until fragrant and translucent;Add beef cubes and cook until lightly browned on all sides; sprinkle curry powder, coriander powder, cumin powder, and chili powder over the meat; stir well to coat the beef evenly with the spices;Pour in water and bring to a boil; reduce heat to low and simmer for about 30 minutes until beef is tender and rice begins to soften;Stir occasionally to prevent rice from sticking to the bottom; after 30 minutes, add the drained rice to the pot; mix thoroughly;Continue cooking on low heat, stirring frequently; pour in coconut milk, salt, and sugar; stir well and cook until the rice breaks down and the porridge becomes thick and creamy (about 15 to 20 minutes);Remove lemongrass stalk; taste and adjust seasoning if needed;Serve hot, garnished with fried shallots and fresh chopped cilantro or daun sup; provide lime wedges on the side for a fresh, tangy kick if desired.\n"
    },
    {
        "title": "Butter Chicken",
        "category": "Indian",
        "prepared_by": "Chef Rahman",
        "prep_time": "10 mins",
        "cook_time": "30 mins",
        "servings": 6,
        "image": "img/butter_chicken.jpg",
        "description": "Rich Indian dish featuring marinated chicken cooked in a creamy tomato-based sauce with butter and aromatic spices, typically served with naan or rice.",
        "ingredients": "Chicken (boneless, skinless): 1 kg;\nYogurt (plain, thick): 150 g;\nLemon juice: 1 tbsp;\nGinger paste: 1 tbsp;\nGarlic paste: 1 tbsp;\nRed chili powder: 1 tsp;\nTurmeric powder: 1/2 tsp;\nGaram masala: 1 tsp;\nSalt: to taste;\nButter: 100 g;\nOil: 2 tbsp;\nOnion (finely chopped): 1 large;\nTomatoes (pureed): 400 g;\nFresh cream: 150 ml;\nKasuri methi (dried fenugreek leaves): 1 tbsp;\nSugar: 1 tsp;\nFresh coriander leaves (chopped): for garnish",
        "instructions": "Marinate the chicken pieces with yogurt, lemon juice, ginger paste, garlic paste, red chili powder, turmeric, garam masala, and salt; mix well so all pieces are coated evenly; cover and refrigerate for at least 1 hour or overnight for best flavor;\nHeat oil and half the butter in a large pan over medium heat; add the chopped onions and sauté until golden brown and translucent, stirring frequently to avoid burning;\nAdd the pureed tomatoes to the pan; cook on medium heat until the oil starts to separate from the masala and the mixture thickens, stirring occasionally;\nAdd the marinated chicken pieces to the pan; stir well so the chicken is coated with the tomato and onion mixture; cook on medium heat for about 10 minutes, stirring occasionally;\nReduce the heat to low; cover the pan and let the chicken cook gently until tender, about 15 to 20 minutes; stir occasionally to prevent sticking;\nAdd sugar and kasuri methi by crushing it between your palms for more flavor; stir gently;\nPour in the fresh cream and the remaining butter; mix carefully until butter melts and the gravy is rich and creamy; do not boil after adding cream to avoid curdling;\nCheck seasoning and adjust salt or chili powder if needed; garnish with freshly chopped coriander leaves;\nServe hot with naan, roti, or steamed basmati rice."
    },
    {
        "title": "Palak Paneer",
        "category": "Indian",
        "prepared_by": "Chef Tarla",
        "prep_time": "20 mins",
        "cook_time": "1 hour",
        "servings": 2,
        "image": "img/palak_paneer.jpg",
        "description": "North Indian vegetarian dish of paneer cheese cubes cooked in a creamy spinach gravy seasoned with spices and garlic.",
        "ingredients": "Fresh spinach (palak): 500g; Paneer (Indian cottage cheese): 250g; Onion: 1 medium, finely chopped; Tomato: 1 medium, chopped; Garlic: 4 cloves, minced; Ginger: 1 inch piece, grated; Green chili: 1, chopped (optional); Cumin seeds: 1 tsp; Garam masala: 1 tsp; Red chili powder: 1/2 tsp; Turmeric powder: 1/4 tsp; Fresh cream or yogurt: 2 tbsp (optional); Oil or ghee: 2 tbsp; Salt: to taste; Water: as needed",
        "instructions": "Wash spinach leaves thoroughly to remove dirt; Blanch spinach in boiling water for 2 minutes until wilted; Drain and immediately transfer to cold water to preserve green color; Drain again and blend spinach into a smooth puree; Heat oil or ghee in a pan over medium heat; Add cumin seeds and let them splutter; Add chopped onions and sauté until golden brown; Add minced garlic, grated ginger, and green chili; Cook for 1-2 minutes until fragrant; Add chopped tomatoes and cook until they soften and oil starts to separate; Add turmeric powder, red chili powder, and salt; Stir well and cook for a minute; Pour in the spinach puree and mix thoroughly; Add some water if the mixture is too thick; Cook the spinach mixture for 5-7 minutes on medium heat; Add garam masala and stir; Cut paneer into cubes and gently add to the spinach gravy; Cook for 3-4 minutes to let paneer absorb flavors; Stir in fresh cream or yogurt for richness, if using; Adjust salt and spice levels to taste; Remove from heat and serve hot with roti, naan, or rice."
    },
    {
        "title": "Chicken Biryani",
        "category": "Indian",
        "prepared_by": "Chef Tarla",
        "prep_time": "15 mins",
        "cook_time": "40 mins",
        "servings": 3,
        "image": "img/biryani.jpg",
        "description": "Fragrant Indian rice dish cooked with marinated chicken, basmati rice, and spices, layered and steamed for a rich, flavorful meal.",
        "ingredients": "Chicken (cut into pieces): 1 kg; Basmati rice: 2 cups; Onions (thinly sliced): 2 large; Tomatoes (chopped): 2 medium; Garlic paste: 1 tbsp; Ginger paste: 1 tbsp; Green chilies (slit): 2; Yogurt: 1 cup; Biryani masala powder: 2 tbsp; Turmeric powder: 1/2 tsp; Red chili powder: 1 tsp; Garam masala powder: 1 tsp; Fresh coriander leaves (chopped): 1/2 cup; Fresh mint leaves (chopped): 1/2 cup; Lemon juice: 2 tbsp; Cooking oil: 4 tbsp; Ghee (clarified butter): 2 tbsp; Whole spices (bay leaf-1, cloves-4, cinnamon stick-1 inch, cardamom pods-4); Salt: to taste; Water: 4 cups",
        "instructions": "Wash the basmati rice thoroughly and soak it in water for 30 minutes; Drain and keep aside.\nHeat oil in a heavy-bottom pan; Add whole spices and sauté until fragrant.\nAdd sliced onions and fry until golden brown; Remove half of the fried onions and keep aside for garnishing.\nAdd ginger paste, garlic paste, and green chilies; Sauté for 2 minutes until raw smell disappears.\nAdd chopped tomatoes and cook until soft and oil starts to separate.\nAdd chicken pieces; Stir and cook on medium heat until chicken changes color.\nAdd yogurt, turmeric powder, red chili powder, biryani masala, and salt; Mix well to coat the chicken with spices.\nCook covered for 10-15 minutes on low heat until chicken is partially cooked and oil separates.\nMeanwhile, boil 4 cups of water in a large pot; Add salt and soaked rice; Cook rice until it is 70% done; Drain and set aside.\nLayer the partially cooked chicken in the pan; Sprinkle chopped coriander, mint leaves, garam masala, and lemon juice evenly over the chicken.\nAdd a layer of the partially cooked rice on top of the chicken; Spread the reserved fried onions over the rice; Drizzle ghee evenly.\nCover the pan tightly with a lid; Cook on very low heat (dum) for 25-30 minutes to allow flavors to blend and rice to fully cook.\nTurn off the heat and let the biryani rest for 10 minutes before opening the lid.\nGently fluff the biryani with a fork; Serve hot with raita or salad."
    },
    {
        "title": "Chole",
        "category": "Indian",
        "prepared_by": "Chef Rahman",
        "prep_time": "10 mins",
        "cook_time": "15 mins",
        "servings": 5,
        "image": "img/chole.jpg",
        "description": "Dish made with chickpeas simmered in a spicy, tangy tomato-based gravy, often served with rice or flatbread.",
        "ingredients": "Chickpeas (kabuli chana), soaked overnight: 1 cup;\nOnion, finely chopped: 1 large;\nTomatoes, pureed: 2 medium;\nGreen chili, chopped: 1;\nGinger-garlic paste: 1 tbsp;\nOil: 3 tbsp;\nCumin seeds: 1 tsp;\nAsafoetida (hing): a pinch;\nTurmeric powder: ½ tsp;\nRed chili powder: 1 tsp;\nCoriander powder: 2 tsp;\nCumin powder: 1 tsp;\nGaram masala: 1 tsp;\nChole masala (optional): 1 tbsp;\nSalt: to taste;\nWater: 2 cups;\nFresh coriander leaves, chopped (for garnish): 2 tbsp;\nLemon juice: 1 tbsp",
        "instructions": "Drain and rinse soaked chickpeas; pressure cook with enough water and a pinch of salt until soft;\nHeat oil in a pan; add cumin seeds and let them splutter; add a pinch of asafoetida; add chopped onions and sauté until golden brown;\nAdd ginger-garlic paste and green chili; sauté for 2 minutes until raw smell disappears;\nAdd pureed tomatoes and cook on medium heat until oil separates from the masala;\nAdd turmeric, red chili powder, coriander powder, and cumin powder; mix well and cook for 2 minutes;\nAdd cooked chickpeas along with the cooking water; stir and bring to a boil;\nReduce heat and simmer uncovered for 15-20 minutes to thicken the gravy;\nAdd chole masala and garam masala; mix and cook for another 5 minutes;\nCheck seasoning and add salt as needed; squeeze lemon juice and stir;\nGarnish with chopped coriander leaves; serve hot with bhature, puri, or rice."
    },
    {
        "title": "Samosa",
        "category": "Indian",
        "prepared_by": "Chef Ranveer",
        "prep_time": "10 mins",
        "cook_time": "1 hour",
        "servings": 4,
        "image": "img/samosa.jpg",
        "description": "Deep-fried pastry with a savory filling, typically of spiced potatoes, peas, and sometimes meat, commonly eaten as a snack or appetizer in South Asia.",
        "ingredients": "All-purpose flour: 2 cups;\nWater: 1/2 cup (approx.);\nOil (for dough): 2 tbsp;\nSalt: 1 tsp;\nPotatoes (boiled and mashed): 3 medium;\nGreen peas (boiled): 1/2 cup;\nGreen chili (finely chopped): 1;\nGinger (grated): 1 tsp;\nCumin seeds: 1 tsp;\nCoriander powder: 1 tsp;\nGaram masala: 1/2 tsp;\nRed chili powder: 1/2 tsp;\nAmchur (dry mango powder): 1/2 tsp (optional);\nFresh coriander (chopped): 2 tbsp;\nOil (for frying): as needed",
        "instructions": "To prepare the dough, mix flour, salt, and 2 tbsp oil in a bowl; gradually add water little by little and knead into a firm, smooth dough; cover it with a damp cloth and set aside for 30 minutes;\nMeanwhile, prepare the filling by heating 1 tbsp oil in a pan; add cumin seeds and let them splutter; add grated ginger and chopped green chili and sauté for a minute;\nAdd boiled potatoes and green peas to the pan; mix well; add coriander powder, garam masala, red chili powder, amchur powder, and salt; stir everything together and cook for 3-4 minutes; remove from heat and mix in chopped coriander; let the filling cool;\nDivide the dough into equal-sized balls; roll each ball into a thin oval or circle about 6-7 inches in diameter; cut the rolled dough into two halves with a knife;\nTake one half and form a cone by folding the straight edge corners together; seal the edge by applying a little water; fill the cone with 2 tbsp of the filling;\nSeal the open edges of the cone carefully by pressing and folding to form a triangular samosa shape; ensure there are no gaps;\nHeat oil in a deep frying pan over medium heat; test the oil by dropping a small piece of doughit should sizzle and rise to the surface;\nFry the samosas in batches, turning occasionally, until they are golden brown and crisp; remove and drain on paper towels;\nServe hot with chutney or ketchup."
    },
    {
        "title": "Paneer Tikka",
        "category": "Indian",
        "prepared_by": "Chef Ranveer",
        "prep_time": "20 mins",
        "cook_time": "15 mins",
        "servings": 5,
        "image": "img/paneer_tikka.jpg",
        "description": "Vegetarian Indian dish where cubes of paneer cheese are marinated in yogurt and spices, then grilled or roasted until charred.",
        "ingredients": "Paneer (cubed): 250g;\nThick Yogurt: 1 cup;\nGinger-Garlic Paste: 1 tbsp;\nRed Chili Powder: 1 tsp;\nTurmeric Powder: 1/2 tsp;\nGaram Masala: 1 tsp;\nCumin Powder: 1/2 tsp;\nChat Masala: 1/2 tsp;\nLemon Juice: 1 tbsp;\nSalt: to taste;\nOil: 2 tbsp;\nBell Peppers (cubed): 1 medium;\nOnion (cubed): 1 medium;\nSkewers: as needed",
        "instructions": "Start by preparing the marinade; in a large bowl, whisk together yogurt, ginger-garlic paste, red chili powder, turmeric powder, garam masala, cumin powder, chat masala, lemon juice, salt, and 1 tablespoon of oil until smooth and well combined;\nAdd the paneer cubes, bell peppers, and onion pieces into the marinade; gently toss everything together so the marinade coats each piece evenly; cover the bowl with cling film and refrigerate for at least 1 hour, allowing the flavors to develop;\nPreheat your grill or oven to 200°C (about 400°F); if using an oven, line a baking tray with foil and grease it lightly with oil to prevent sticking;\nThread the marinated paneer cubes alternately with bell pepper and onion pieces onto the skewers; make sure not to overcrowd the skewers for even cooking;\nPlace the skewers on the tray or grill rack; brush the remaining oil over the paneer and vegetables to keep them moist while cooking;\nGrill or bake for 15-20 minutes, turning the skewers halfway through the cooking time to ensure all sides are evenly cooked and slightly charred;\nOnce cooked, remove from the oven or grill carefully; sprinkle some chat masala and extra lemon juice over the paneer tikka for added tanginess;\nServe hot with green chutney and sliced onions on the side; enjoy your delicious homemade paneer tikka!"
    },
    {
        "title": "Aloo Gobi",
        "category": "Indian",
        "prepared_by": "Chef Vikas",
        "prep_time": "10 mins",
        "cook_time": "40 mins",
        "servings": 4,
        "image": "img/aloo_gobi.jpg",
        "description": "Dry Indian curry featuring potatoes (aloo) and cauliflower (gobi) sautéed with turmeric, cumin, and other spices.",
        "ingredients": "Potatoes (Aloo): 3 medium, peeled and diced;Cauliflower (Gobi): 1 medium head, cut into florets;Onion: 1 large, finely chopped;Tomato: 1 medium, chopped;Green chili: 1, slit (optional);Ginger: 1 inch, grated;Garlic: 3 cloves, minced;Cumin seeds: 1 tsp;Turmeric powder: 1/2 tsp;Red chili powder: 1/2 tsp;Coriander powder: 1 tsp;Garam masala: 1/2 tsp;Salt: to taste;Oil: 3 tbsp;Fresh coriander leaves: for garnish",
        "instructions": "Heat oil in a pan until hot;Add cumin seeds and let them splutter;Add chopped onions and sauté until golden brown;Add minced garlic, grated ginger, and green chili;Sauté for 1-2 minutes until fragrant;Add chopped tomato and cook until soft and mushy;Add turmeric, red chili powder, coriander powder, and salt;Mix spices well with the tomato mixture;Add diced potatoes and cauliflower florets;Stir everything gently to coat vegetables with the spices;Cover the pan with a lid and cook on low heat for 15-20 minutes;Check occasionally and stir carefully to avoid sticking;If needed, sprinkle a little water to prevent burning;Cook until potatoes and cauliflower are tender but not mushy;Sprinkle garam masala and mix gently;Turn off the heat and garnish with fresh coriander leaves;Serve hot with chapati or rice."
    },
    {
        "title": "Tandoori Chicken",
        "category": "Indian",
        "prepared_by": "Chef Vikas",
        "prep_time": "15 mins",
        "cook_time": "1 hour",
        "servings": 5,
        "image": "img/tandoori_chicken.jpg",
        "description": "Indian dish made by marinating chicken in yogurt and spices, then roasting it in a tandoor (clay oven) until smoky and tender.",
        "ingredients": "Chicken (with skin, whole or cut): 1 kg;\nYogurt (thick, plain): 1 cup;\nLemon juice: 2 tbsp;\nGarlic paste: 1 tbsp;\nGinger paste: 1 tbsp;\nGaram masala: 1 tsp;\nGround cumin: 1 tsp;\nGround coriander: 1 tsp;\nTurmeric powder: 1/2 tsp;\nRed chili powder (or Kashmiri chili powder for color): 1-2 tsp;\nSalt: 1 tsp (or to taste);\nOil: 2 tbsp;\nOptional: red food coloring (a pinch)",
        "instructions": "Clean the chicken and pat dry with paper towels;Make deep cuts on the chicken to allow marinade to penetrate;In a large bowl, mix yogurt, lemon juice, garlic paste, ginger paste, garam masala, cumin, coriander, turmeric, chili powder, salt, oil, and food coloring if using;Whisk the marinade until smooth and well combined;Coat the chicken thoroughly with the marinade, making sure to rub inside the cuts;Cover the bowl and refrigerate for at least 6 hours, preferably overnight;Preheat the oven to 200°C (400°F);Place the marinated chicken on a baking tray lined with foil or on a grill rack;Bake or grill the chicken for 25 to 30 minutes, turning halfway through to ensure even cooking;Check that the chicken is cooked through by piercing the thickest partjuices should run clear;For a charred effect, broil the chicken for the last 2-3 minutes;Remove from oven and let rest for 5 minutes before serving;Serve hot with sliced onions, lemon wedges, and mint chutney."
    },
    {
        "title": "Roti",
        "category": "Indian",
        "prepared_by": "Chef Sanjeev ",
        "prep_time": "10 mins",
        "cook_time": "1 hour",
        "servings": 3,
        "image": "img/roti.jpg",
        "description": "Simple, soft flatbread made with whole wheat flour, commonly served with curries, lentils, or vegetables.",
        "ingredients": "Whole wheat flour (atta): 2 cups;\nWater: about ¾ cup (adjust as needed);\nSalt: ½ tsp;\nOil or ghee: 1 tbsp (optional);\nDry flour (for dusting): as needed",
        "instructions": "In a large bowl, mix whole wheat flour and salt evenly; slowly add water little by little while stirring with your hand or a spoon to form a rough dough; Once all water is added, knead the dough in the bowl for about 8-10 minutes until it becomes soft and pliable; If the dough feels sticky, sprinkle a little dry flour and continue kneading; Cover the dough with a damp cloth and let it rest for at least 30 minutes to relax the gluten; After resting, knead the dough again briefly and divide it into small equal-sized balls, about golf ball size; Lightly dust your rolling surface and rolling pin with dry flour to prevent sticking; Take one dough ball and flatten it slightly; Roll it out evenly into a thin, round disc about 6-8 inches in diameter; Heat a flat skillet or tava over medium-high heat until hot; Place the rolled roti on the hot skillet; Cook for about 30 seconds or until you see bubbles forming on the surface; Flip the roti using tongs or spatula and cook the other side for 30 seconds until light brown spots appear; Flip again and press gently with a clean cloth or spatula to encourage puffing; When the roti puffs up fully, flip once more to cook evenly; Remove from the skillet and brush lightly with ghee or butter if desired; Repeat the rolling and cooking process with the remaining dough balls; Serve hot with curry or vegetables."
    },
    {
        "title": "Dal Tadka",
        "category": "Indian",
        "prepared_by": "Chef Sanjeev ",
        "prep_time": "20 mins",
        "cook_time": "1 hour",
        "servings": 4,
        "image": "img/dal_tadka.jpg",
        "description": "Lentils dish made with yellow lentils simmered until soft, then tempered with spices, garlic, and ghee for added flavor.",
        "ingredients": "Toor dal (split pigeon peas): 1 cup;\nWater: 3 cups;\nTurmeric powder: 1/2 tsp;\nSalt: to taste;\nGhee or oil: 2 tbsp;\nCumin seeds: 1 tsp;\nMustard seeds: 1/2 tsp;\nAsafoetida (hing): a pinch;\nGarlic cloves: 4, finely chopped;\nGreen chili: 1, slit;\nOnion: 1 medium, finely chopped;\nTomato: 1 medium, chopped;\nRed chili powder: 1 tsp;\nGaram masala: 1/2 tsp;\nFresh coriander leaves: a handful, chopped;\nLemon juice: 1 tbsp (optional)",
        "instructions": "Rinse toor dal thoroughly until water runs clear; soak for 15-20 minutes if time allows;\nIn a pressure cooker or pot, add dal, water, turmeric powder, and salt; cook until dal is soft and mushy; set aside;\nHeat ghee or oil in a pan over medium heat; add cumin seeds and mustard seeds; let them splutter;\nAdd asafoetida, then sauté chopped garlic and green chili until garlic turns golden brown;\nAdd chopped onions and cook until they turn translucent and soft;\nAdd chopped tomatoes and cook until they become soft and oil starts to separate;\nMix in red chili powder and garam masala; stir for a few seconds;\nPour the cooked dal into the pan; stir well to combine all ingredients;\nAdd water if the dal is too thick; bring it to a gentle boil and simmer for 5-7 minutes;\nAdjust salt to taste; sprinkle chopped coriander leaves on top;\nTurn off heat; add lemon juice if using; mix gently;\nServe hot with steamed rice or roti."
    },
    {
        "title": "Kung Pao Chicken",
        "category": "Chinese",
        "prepared_by": "Chef Kenji",
        "prep_time": "25 mins",
        "cook_time": "40 mins",
        "servings": 3,
        "image": "img/kung_pao.jpg",
        "description": "Classic Sichuan stir-fry made with chicken, peanuts, vegetables, and dried chilies in a tangy and spicy sauce.",
        "ingredients": "Chicken breast (diced): 500g;\nDry roasted peanuts: 1/2 cup;\nDried red chili peppers: 6-8 (adjust to taste);\nGarlic (minced): 3 cloves;\nGinger (minced): 1 tbsp;\nGreen onions (chopped): 3 stalks;\nSoy sauce: 3 tbsp;\nDark soy sauce: 1 tbsp;\nRice vinegar: 1 tbsp;\nSugar: 1 tsp;\nCornstarch: 1 tsp;\nWater: 3 tbsp;\nSesame oil: 1 tsp;\nVegetable oil: 3 tbsp;\nSalt: to taste",
        "instructions": "Mix soy sauce, dark soy sauce, rice vinegar, sugar, cornstarch, and water in a bowl to make the sauce;\nHeat vegetable oil in a wok or large pan over medium-high heat until hot but not smoking;\nAdd dried red chili peppers and stir-fry for about 30 seconds until fragrant but not burnt;\nAdd minced garlic and ginger immediately; stir quickly for 15 seconds to release aroma;\nAdd diced chicken to the wok and stir-fry until chicken is cooked through and lightly browned, about 5-7 minutes;\nPour the prepared sauce over the chicken and stir continuously to coat the chicken evenly and thicken the sauce;\nAdd roasted peanuts and chopped green onions; toss everything together for another 1-2 minutes;\nDrizzle sesame oil on top for aroma and stir once more;\nTaste and adjust salt if needed;\nServe hot with steamed rice."
    },
    {
        "title": "Char Kue Teow",
        "category": "Chinese",
        "prepared_by": "Chef Ching",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/char.jpg",
        "description": "Malaysian stir-fried flat rice noodle dish cooked with soy sauce, prawns, eggs, bean sprouts, and Chinese sausage.",
        "ingredients": "Flat rice noodles (kue tiau): 300g;\nPrawns (peeled and deveined): 150g;\nChinese sausage (lap cheong), sliced thin: 1;\nEggs: 2;\nBean sprouts: 100g;\nChives, cut into 2-inch lengths: 50g;\nGarlic, minced: 3 cloves;\nSoy sauce: 2 tbsp;\nDark soy sauce: 1 tbsp;\nOyster sauce: 1 tbsp;\nWhite pepper: 1/4 tsp;\nCooking oil: 3 tbsp;\nLard or butter (optional): 1 tbsp;\nSalt: to taste;\nChili paste (optional): to serve",
        "instructions": "Heat wok over high heat until very hot; add cooking oil and lard or butter if using;\nAdd minced garlic and stir-fry until fragrant but not burnt;\nAdd sliced Chinese sausage and prawns; stir-fry until prawns turn pink and sausage is slightly crispy;\nPush ingredients to one side; crack eggs into the empty side and scramble lightly;\nAdd flat rice noodles; toss gently to mix with egg and other ingredients;\nPour in soy sauce, dark soy sauce, oyster sauce, and sprinkle white pepper; stir-fry quickly to coat noodles evenly;\nAdd bean sprouts and chives; toss everything together quickly but thoroughly;\nAdjust salt if needed; stir-fry for another 1-2 minutes until noodles are heated through but not mushy;\nRemove from heat; serve hot with chili paste on the side if desired."
    },
    {
        "title": "Chinese Fried Rice",
        "category": "Chinese",
        "prepared_by": "Chef Anita Lo",
        "prep_time": "20 mins",
        "cook_time": "30 mins",
        "servings": 5,
        "image": "img/fried_rice.jpg",
        "description": "Versatile dish of stir-fried rice with eggs, vegetables, and often chicken or shrimp, flavored with soy sauce and sesame oil.",
        "ingredients": "Cooked rice (preferably day-old): 4 cups; Eggs: 2; Cooking oil: 3 tbsp; Garlic: 3 cloves, minced; Onion: 1 small, diced; Carrots: 1/2 cup, diced; Frozen peas: 1/2 cup; Green onions: 2 stalks, chopped; Soy sauce: 2 tbsp; Oyster sauce (optional): 1 tbsp; Salt: to taste; White pepper: a pinch",
        "instructions": "Heat 1 tablespoon of oil in a large pan or wok over medium-high heat; Crack the eggs into the pan and scramble quickly until just set; Remove eggs and set aside; Add the remaining 2 tablespoons of oil to the pan; Sauté garlic and onion until fragrant and translucent, about 1-2 minutes; Add diced carrots and cook for 2-3 minutes until slightly tender; Stir in frozen peas and cook for another minute; Add the cold cooked rice, breaking up any clumps with a spatula; Stir-fry the rice, mixing it thoroughly with the vegetables; Drizzle soy sauce and oyster sauce evenly over the rice; Stir continuously to coat the rice evenly and heat through; Return the scrambled eggs to the pan and mix them into the rice; Season with salt and white pepper to taste; Finally, sprinkle chopped green onions over the rice and give a quick stir; Serve hot immediately."
    },
    {
        "title": "Spring Rolls",
        "category": "Chinese",
        "prepared_by": "Chef Anita Lo",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 6,
        "image": "img/spring_rolls.jpg",
        "description": "Crispy appetizers filled with vegetables and sometimes meat, wrapped in thin pastry and deep-fried or served fresh with dipping sauce.",
        "ingredients": "Spring roll wrappers: 12 sheets;\nCabbage: 2 cups, shredded;\nCarrot: 1 medium, julienned;\nBean sprouts: 1 cup;\nGreen onions: 3 stalks, chopped;\nGarlic: 2 cloves, minced;\nSoy sauce: 2 tbsp;\nSesame oil: 1 tbsp;\nVegetable oil: for frying;\nSalt: to taste;\nPepper: to taste;\nCornstarch: 1 tbsp (mixed with 2 tbsp water for sealing)",
        "instructions": "Heat a tablespoon of vegetable oil in a pan over medium heat;Add minced garlic and sauté until fragrant;Add cabbage, carrot, bean sprouts, and green onions;Stir-fry vegetables for about 3-4 minutes until slightly softened;Season with soy sauce, sesame oil, salt, and pepper;Cook for another 1-2 minutes and remove from heat;Let the filling cool slightly;Place one spring roll wrapper on a clean surface in a diamond shape;Spoon about 2 tablespoons of filling near the bottom corner;Fold the bottom corner over the filling;Fold in the left and right corners toward the center;Roll tightly toward the top corner;Seal the edge with cornstarch paste;Repeat with remaining wrappers and filling;Heat vegetable oil in a deep pan or wok to 350°F (175°C);Fry spring rolls in batches until golden brown and crispy, about 3-5 minutes;Remove and drain on paper towels;Serve hot with dipping sauce of choice."
    },
    {
        "title": "Mapo Tofu",
        "category": "Chinese",
        "prepared_by": "Chef Martin",
        "prep_time": "10 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/mapo_tofu.jpg",
        "description": "Spicy Sichuan dish made with soft tofu, minced pork or beef, and a chili bean sauce, topped with Sichuan peppercorns for a numbing heat.",
        "ingredients": "Soft tofu: 400g, cut into cubes;Ground pork: 200g;Garlic: 3 cloves, minced;Ginger: 1 inch piece, minced;Green onions: 2, chopped;Doubanjiang (fermented chili bean paste): 2 tbsp;Soy sauce: 1 tbsp;Shaoxing wine (or dry sherry): 1 tbsp;Chicken broth or water: 150ml;Cornstarch: 1 tsp, mixed with 2 tsp water;Sichuan peppercorn powder: 1 tsp;Sugar: 1 tsp;Oil (vegetable or canola): 2 tbsp",
        "instructions": "Heat the oil in a wok or large pan over medium-high heat;Add the minced garlic, ginger, and half of the green onions;Stir-fry for about 30 seconds until fragrant but not burnt;Add the ground pork;Break it apart with your spatula and cook until browned and no longer pink;Add the doubanjiang (chili bean paste) and stir well to coat the pork;Cook for 1-2 minutes to release the flavors;Pour in the Shaoxing wine and let it evaporate for a few seconds;Add the soy sauce, sugar, and chicken broth or water;Bring the mixture to a simmer;Gently add the tofu cubes, being careful not to break them;Simmer gently for about 5 minutes to allow the tofu to absorb the flavors;Stir the cornstarch slurry and slowly pour it into the pan while gently stirring;Cook until the sauce thickens and becomes glossy;Sprinkle the Sichuan peppercorn powder evenly and give a gentle stir;Turn off the heat and garnish with the remaining chopped green onions;Serve hot with steamed rice."
    },
    {
        "title": "Chow Mein",
        "category": "Chinese",
        "prepared_by": "Chef Susur Lee",
        "prep_time": "20 mins",
        "cook_time": "15 mins",
        "servings": 6,
        "image": "img/chow_mein.jpg",
        "description": "Chinese stir-fried noodle dish tossed with vegetables, meat or shrimp, and a savory soy-based sauce.",
        "ingredients": "Egg noodles: 300g; Chicken breast or beef: 250g, thinly sliced; Carrot: 1 medium, julienned; Bell pepper: 1, thinly sliced; Cabbage: 1 cup, shredded; Green onions: 3, chopped; Garlic: 3 cloves, minced; Soy sauce: 4 tbsp; Oyster sauce: 2 tbsp; Sesame oil: 1 tsp; Vegetable oil: 3 tbsp; Salt: to taste; Black pepper: to taste; Water or chicken broth: 1/4 cup",
        "instructions": "Boil egg noodles in salted water until just tender; drain and rinse with cold water to stop cooking; set aside;Heat vegetable oil in a large pan or wok over medium-high heat; add minced garlic and sauté until fragrant but not browned;Add sliced chicken or beef and stir-fry until cooked through and no longer pink; remove meat from pan and set aside;In the same pan, add a bit more oil if needed; add carrots, bell pepper, and cabbage; stir-fry for 3-4 minutes until vegetables are crisp-tender;Return the cooked meat to the pan with the vegetables; toss to combine;Add the cooked noodles to the pan; pour in soy sauce, oyster sauce, and water or broth; stir everything thoroughly to mix the sauce evenly;Cook for 2-3 minutes, allowing the noodles to absorb the flavors; drizzle sesame oil over the top; season with salt and black pepper to taste; toss again gently;Turn off heat and sprinkle chopped green onions on top; serve immediately while hot."
    },
    {
        "title": "Egg Drop Soup",
        "category": "Chinese",
        "prepared_by": "Chef Martin",
        "prep_time": "25 mins",
        "cook_time": "40 mins",
        "servings": 5,
        "image": "img/egg_drop.jpg",
        "description": "light Chinese soup made with beaten eggs stirred into hot broth to create silky ribbons, often flavored with scallions and white pepper.",
        "ingredients": "Chicken broth: 4 cups;Eggs: 2 large;Cornstarch: 1 tbsp;Water: 2 tbsp;Ginger: 1 tsp grated;Salt: 1/2 tsp;White pepper: 1/4 tsp;Green onions: 2 stalks, sliced;Sesame oil: 1 tsp (optional)",
        "instructions": "In a small bowl, mix cornstarch and water until smooth;Heat chicken broth in a pot over medium heat until it begins to simmer;Add grated ginger, salt, and white pepper to the broth;Stir in the cornstarch mixture to thicken the broth slightly;Beat the eggs lightly in a separate bowl;Slowly pour the beaten eggs into the simmering broth in a thin stream while stirring gently with a fork or chopsticks;Continue stirring until egg ribbons form and cook fully;Remove from heat and add sliced green onions and sesame oil if using;Serve hot immediately."
    },
    {
        "title": "Dim Sum",
        "category": "Chinese",
        "prepared_by": "Chef Susur Lee",
        "prep_time": "15 mins",
        "cook_time": "1 hour",
        "servings": 6,
        "image": "img/dim_sum.jpg",
        "description": "Variety of small Chinese dishes such as dumplings, buns, and rolls, traditionally served with tea in a communal dining experience.",
        "ingredients": "Shrimp (peeled and deveined): 300g;\nWheat starch: 150g;\nTapioca starch: 50g;\nBoiling water: 180ml;\nSesame oil: 1 tsp;\nSalt: 1/2 tsp;\nSugar: 1/4 tsp;\nWhite pepper: a pinch;\nCooking oil: 1 tsp;\nBamboo shoots (finely chopped): 50g;\nSoy sauce: 1 tbsp;\nCornstarch: 1 tsp (mixed with 2 tbsp water);",
        "instructions": "Prepare the shrimp by chopping roughly into small pieces; season with salt, sugar, white pepper, and sesame oil; mix well and set aside;\nBoil water and pour it gradually over the wheat starch and tapioca starch in a mixing bowl; stir quickly with chopsticks or a spatula to form a dough; let it cool slightly until safe to handle;\nKnead the dough with your hands until smooth and elastic; add cooking oil to prevent sticking; cover with a damp cloth to keep moist;\nDivide dough into small equal portions; roll each portion into a thin, round wrapper about 3 inches in diameter;\nMix chopped bamboo shoots with soy sauce and cornstarch slurry; add this mixture to the seasoned shrimp; combine gently;\nPlace a small spoonful of shrimp filling in the center of each wrapper; fold the wrapper in half and pleat the edges to seal, forming a crescent shape;\nPrepare a steamer lined with parchment paper or cabbage leaves; place dumplings with some space between them to avoid sticking;\nSteam the dumplings over boiling water for 6-8 minutes or until the wrappers turn translucent and the shrimp filling is cooked through;\nServe immediately with soy sauce or chili oil as desired;"
    },
    {
        "title": "Steamed Fish",
        "category": "Chinese",
        "prepared_by": "Chef Ken Hom",
        "prep_time": "25 mins",
        "cook_time": "1 hour",
        "servings": 3,
        "image": "img/steamed_fish.jpg",
        "description": "Chinese-style whole fish dish often seasoned with ginger, soy sauce, and scallions, then gently steamed for a delicate flavor.",
        "ingredients": "Whole fish (such as snapper or sea bass): 1 (about 500g), cleaned and scaled;\nGinger: 3 slices, julienned;\nGreen onions: 2 stalks, cut into 5cm pieces;\nSoy sauce: 2 tbsp;\nSesame oil: 1 tbsp;\nCooking oil: 2 tbsp;\nSalt: 1/2 tsp;\nWhite pepper: a pinch;\nFresh cilantro (optional): for garnish",
        "instructions": "Clean the fish thoroughly and pat dry with paper towels; season the fish inside and out with salt and white pepper;\nPlace half of the ginger slices and one stalk of green onion inside the fish cavity; arrange the fish on a heatproof plate suitable for steaming;\nScatter the remaining ginger and green onion on top of the fish; prepare a steamer by bringing water to a boil;\nPlace the plate with fish into the steamer carefully; cover the lid tightly and steam over high heat for about 8 to 10 minutes, depending on fish thickness;\nCheck for doneness by inserting a fork or chopstick at the thickest part  to  the flesh should flake easily and be opaque;\nWhile the fish is steaming, heat cooking oil in a small pan until hot but not smoking;\nOnce fish is cooked, carefully remove the plate from the steamer; drizzle soy sauce and sesame oil evenly over the fish;\nPour the hot cooking oil over the fish and garnish with fresh cilantro if desired; serve immediately."
    },
    {
        "title": "Char Siu",
        "category": "Chinese",
        "prepared_by": "Chef Ken Hom",
        "prep_time": "20 mins",
        "cook_time": "1 hour",
        "servings": 5,
        "image": "img/char_siu.jpg",
        "description": "Cantonese-style barbecued pork that is marinated in a sweet and savory sauce and roasted until caramelized and tender.",
        "ingredients": "Pork shoulder (boneless): 1 kg;Honey: 3 tbsp;Soy sauce (light): 4 tbsp;Hoisin sauce: 3 tbsp;Chinese five-spice powder: 1 tsp;Shaoxing wine (or dry sherry): 2 tbsp;Brown sugar: 2 tbsp;Garlic (minced): 3 cloves;Red food coloring (optional): a few drops",
        "instructions": "Mix honey, soy sauce, hoisin sauce, five-spice powder, Shaoxing wine, brown sugar, minced garlic, and red food coloring in a bowl to create the marinade;Slice the pork shoulder into long strips about 2 inches wide for even cooking;Place pork strips in the marinade, cover well, and refrigerate for at least 4 hours or overnight for best flavor;Preheat the oven to 200°C (390°F) and line a baking tray with foil, placing a wire rack on top;Arrange the marinated pork strips on the rack, reserving the leftover marinade;Roast the pork for 15 minutes, then baste with the reserved marinade and turn the pieces over;Continue roasting for another 15 minutes, basting again halfway through, until the pork is cooked through and nicely caramelized;For a sticky glaze, increase the oven temperature to 220°C (430°F) in the last 5 minutes, watching carefully to avoid burning;Remove from oven and let the char siu rest for 5 minutes before slicing;Serve sliced pork with steamed rice or in bao buns."
    },
    {
        "title": "Kimchi Fried Rice",
        "category": "Korean",
        "prepared_by": "Chef Jisoo",
        "prep_time": "20 mins",
        "cook_time": "15 mins",
        "servings": 3,
        "image": "img/kimchi_fried.jpg",
        "description": "Korean dish where cooked rice is stir-fried with kimchi, garlic, and gochujang, often topped with a fried egg.",
        "ingredients": "Cooked rice: 3 cups (preferably day-old);Kimchi: 1 cup, chopped;Kimchi juice: 2 tbsp;Eggs: 2;Green onion: 2 stalks, chopped;Garlic: 2 cloves, minced;Soy sauce: 1 tbsp;Sesame oil: 1 tbsp;Vegetable oil: 2 tbsp;Sugar: 1 tsp;Salt: to taste;Sesame seeds: 1 tsp (optional);Fried seaweed strips: for garnish (optional)",
        "instructions": "Heat vegetable oil in a large pan or wok over medium-high heat;Add minced garlic and sauté until fragrant, about 30 seconds;Add chopped kimchi and cook for 3-4 minutes until soft and slightly caramelized;Pour in kimchi juice and stir well;Add the cooked rice, breaking up any clumps with a spatula;Mix thoroughly with kimchi until rice is evenly coated and heated through;Add soy sauce and sugar, stir well to balance flavors;Push the rice to one side of the pan and crack eggs into the empty space;Scramble eggs gently until mostly cooked, then mix eggs into the rice evenly;Add chopped green onions and drizzle sesame oil over the mixture;Taste and add salt if needed, mix everything well;Remove from heat and serve hot, garnished with sesame seeds and fried seaweed strips if using."
    },
    {
        "title": "Bibimbap",
        "category": "Korean",
        "prepared_by": "Chef Edward",
        "prep_time": "25 mins",
        "cook_time": "1 hour",
        "servings": 5,
        "image": "img/bibimbap.jpg",
        "description": "Korean rice bowl topped with assorted vegetables, meat, and a fried egg, mixed with gochujang (chili paste) before eating.",
        "ingredients": "Cooked rice: 3 cups;\nCarrot: 1, julienned;\nZucchini: 1, julienned;\nSpinach: 1 cup, blanched and squeezed;\nBean sprouts: 1 cup, blanched;\nMushrooms (shiitake or button): 1 cup, sliced;\nEggs: 2;\nGarlic: 2 cloves, minced;\nSoy sauce: 3 tbsp;\nSesame oil: 2 tbsp;\nVegetable oil: 2 tbsp;\nGochujang (Korean chili paste): 3 tbsp;\nSugar: 1 tsp;\nSalt: to taste;\nSesame seeds: 1 tbsp",
        "instructions": "Prepare all vegetables by washing and cutting as described; blanch spinach and bean sprouts separately in boiling water for about 1 minute each, then rinse with cold water and squeeze out excess moisture; season spinach and bean sprouts lightly with salt, minced garlic, 1 tsp sesame oil, and a bit of soy sauce, mixing well;\nHeat 1 tbsp vegetable oil in a pan over medium heat; sautée carrots until slightly softened, about 2-3 minutes; remove and set aside; repeat this step for zucchini and mushrooms, cooking each separately to keep flavors distinct; season each sautéed vegetable lightly with salt and a little soy sauce;\nIn a small bowl, mix gochujang with sugar and 1 tsp sesame oil to make the spicy sauce;\nFry eggs sunny-side up in a non-stick pan with a little oil, keeping yolks runny;\nTo assemble, place cooked rice at the bottom of a large bowl; arrange each vegetable neatly on top of the rice in sections; place the fried egg in the center; drizzle sesame oil over the top; sprinkle sesame seeds;\nServe with the gochujang sauce on the side; mix everything well before eating for the best flavor combination."
    },
    {
        "title": "Bulgogi",
        "category": "Korean",
        "prepared_by": "Chef Edward",
        "prep_time": "25 mins",
        "cook_time": "1 hour",
        "servings": 4,
        "image": "img/bulgogi.jpg",
        "description": "Korean dish of thinly sliced beef marinated in a sweet soy-based sauce, then grilled or stir-fried until tender and flavorful.",
        "ingredients": "Beef sirloin or ribeye (thinly sliced): 500g;Soy sauce: 5 tbsp;Brown sugar: 2 tbsp;Sesame oil: 1 tbsp;Garlic (minced): 3 cloves;Green onion (chopped): 2 stalks;Ground black pepper: 1/2 tsp;Grated Asian pear or apple: 1/2 small;Carrot (julienned): 1 small;Onion (thinly sliced): 1 medium;Sesame seeds: 1 tbsp;Cooking oil: 1 tbsp",
        "instructions": "In a large bowl, combine soy sauce, brown sugar, sesame oil, minced garlic, grated pear (or apple), chopped green onions, and ground black pepper;Mix well until sugar is dissolved and marinade is uniform;Add the thinly sliced beef to the marinade;Toss the beef thoroughly so each piece is evenly coated with the marinade;Cover the bowl with plastic wrap and refrigerate for at least 30 minutes, ideally 1-2 hours to let the flavors develop;Heat cooking oil in a large skillet or grill pan over medium-high heat;Add the sliced onions and julienned carrots to the pan and sauté for about 2 minutes until slightly softened;Add the marinated beef slices to the pan, spreading them out evenly;Cook the beef without stirring for 2-3 minutes to get a nice sear;Then stir-fry, turning the beef pieces until fully cooked and caramelized, about another 3-4 minutes;Sprinkle toasted sesame seeds over the cooked beef and mix gently;Serve hot with steamed rice and optional side dishes like kimchi or lettuce wraps."
    },
    {
        "title": "Tteokbokki",
        "category": "Korean",
        "prepared_by": "Chef Baek",
        "prep_time": "20 mins",
        "cook_time": "40 mins",
        "servings": 3,
        "image": "img/tteokbokki.jpg",
        "description": "Spicy Korean street food made with chewy rice cakes cooked in a fiery gochujang sauce, often with fish cakes and boiled eggs.",
        "ingredients": "Korean rice cakes (tteok): 400g;\nFish cakes: 150g, sliced;\nGochujang (Korean chili paste): 3 tbsp;\nGochugaru (Korean chili flakes): 1 tbsp;\nSoy sauce: 2 tbsp;\nSugar: 1 tbsp;\nGarlic: 2 cloves, minced;\nWater: 3 cups;\nGreen onions: 2, chopped;\nBoiled eggs: 2 (optional);\nSesame oil: 1 tsp;\nSesame seeds: 1 tsp (for garnish);",
        "instructions": "Soak the rice cakes in warm water for 10 minutes if they are hard or refrigerated;\nIn a large pan, add water, gochujang, gochugaru, soy sauce, sugar, and minced garlic;\nStir the sauce mixture well to dissolve the gochujang completely;\nBring the sauce to a boil over medium-high heat;\nAdd the rice cakes and fish cakes to the boiling sauce;\nReduce the heat to medium and let it simmer, stirring occasionally to prevent sticking;\nCook for about 10-15 minutes or until the rice cakes become soft and chewy;\nIf using boiled eggs, add them in the last 5 minutes to warm through;\nOnce the sauce thickens to a glossy, sticky consistency, stir in chopped green onions and sesame oil;\nTurn off the heat and sprinkle sesame seeds on top before serving;\nServe hot as a snack or meal with optional boiled eggs on the side;"
    },
    {
        "title": "Japchae",
        "category": "Korean",
        "prepared_by": "Chef Park",
        "prep_time": "25 mins",
        "cook_time": "15 mins",
        "servings": 4,
        "image": "img/japchae.jpg",
        "description": "Korean noodle dish made with stir-fried glass noodles, vegetables, and meat, flavored with soy sauce and sesame oil.",
        "ingredients": "Sweet potato starch noodles (dangmyeon): 200g;\nBeef (sirloin or ribeye): 150g, thinly sliced;\nSpinach: 150g, blanched and squeezed;\nCarrot: 1 medium, julienned;\nShiitake mushrooms: 4-5, sliced thin;\nOnion: 1 small, thinly sliced;\nGarlic: 2 cloves, minced;\nSoy sauce: 4 tbsp;\nSugar: 1 tbsp;\nSesame oil: 2 tbsp;\nVegetable oil: 2 tbsp;\nSesame seeds: 1 tbsp, toasted;\nSalt and pepper: to taste;\nGreen onion: 1 stalk, chopped (optional);",
        "instructions": "Soak sweet potato noodles in warm water for 20-30 minutes until softened; drain and set aside;Boil a pot of water, add noodles and cook for 5-6 minutes until translucent and chewy; drain and rinse under cold water to stop cooking; toss with 1 tbsp sesame oil to prevent sticking;Marinate beef slices in 1 tbsp soy sauce, 1 tsp sugar, and a pinch of pepper for 10 minutes;Heat 1 tbsp vegetable oil in a pan over medium heat; stir-fry marinated beef until cooked through; remove and set aside;In the same pan, add 1 tbsp vegetable oil; sauté garlic and onion until fragrant and translucent; add carrot and mushrooms; cook until vegetables are tender but still crisp; remove and set aside;In a large bowl, combine noodles, cooked beef, sautéed vegetables, and blanched spinach;Add remaining soy sauce, sugar, and 1 tbsp sesame oil; toss everything well to mix flavors evenly;Adjust seasoning with salt and pepper to taste;Transfer to serving plate; sprinkle toasted sesame seeds and chopped green onion on top; serve warm or at room temperature."
    },
    {
        "title": "Kimchi Stew",
        "category": "Korean",
        "prepared_by": "Chef Baek",
        "prep_time": "25 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/kimchi_stew.jpg",
        "description": "(Kimchi Jjigae) is a Korean hot pot made with aged kimchi, tofu, pork, and spicy broth, commonly served bubbling hot.",
        "ingredients": "Kimchi (preferably fermented): 2 cups, chopped;Pork belly or shoulder: 200g, sliced thinly;Tofu: 1 block, cut into cubes;Onion: 1 medium, sliced;Garlic: 3 cloves, minced;Green onion: 2 stalks, chopped;Gochugaru (Korean red chili flakes): 1 tbsp;Gochujang (Korean chili paste): 1 tbsp;Soy sauce: 1 tbsp;Sesame oil: 1 tsp;Water or broth: 3 cups;Salt: to taste;Sugar: 1 tsp (optional)",
        "instructions": "Heat a pot over medium heat and add sesame oil;Add minced garlic and sliced onions, sauté until fragrant and translucent;Add pork slices and cook until they start to brown;Add chopped kimchi and stir-fry together with the pork for about 5 minutes until the kimchi softens and releases aroma;Add gochugaru and gochujang, stirring well to mix all flavors;Pour in the water or broth and bring the mixture to a boil;Once boiling, reduce heat to medium-low and let it simmer for 20 minutes so flavors meld;Add soy sauce and adjust salt to taste;Add tofu cubes gently into the stew;Simmer for another 5-7 minutes without stirring too hard to avoid breaking tofu;Finally, sprinkle chopped green onions on top before serving;Serve hot with steamed rice."
    },
    {
        "title": "Korean Fried Chicken",
        "category": "Korean",
        "prepared_by": "Chef Jisoo",
        "prep_time": "10 mins",
        "cook_time": "1 hour",
        "servings": 5,
        "image": "img/kfried.jpg",
        "description": "Double-fried chicken known for its crispy exterior, often coated in a sweet and spicy sauce or soy garlic glaze.",
        "ingredients": "Chicken wings or drumettes: 1 kg;\nCornstarch: 1 cup;\nAll-purpose flour: ½ cup;\nSalt: 1 tsp;\nBlack pepper: ½ tsp;\nGarlic powder: 1 tsp;\nVegetable oil (for frying): enough for deep frying;Soy sauce: 4 tbsp;\nGochujang (Korean chili paste): 3 tbsp;\nHoney: 3 tbsp;\nBrown sugar: 2 tbsp;\nRice vinegar: 1 tbsp;\nMinced garlic: 2 cloves;\nGrated ginger: 1 tsp;\nSesame oil: 1 tsp;\nWater: 2 tbsp;",
        "instructions": "Prepare chicken by patting dry with paper towels; In a large bowl, combine cornstarch, all-purpose flour, salt, black pepper, and garlic powder; Toss the chicken pieces in the flour mixture until fully coated; Heat vegetable oil in a deep fryer or heavy pot to 175°C (350°F); Fry the chicken in batches to avoid overcrowding; Cook for 8-10 minutes until golden brown and crispy; Remove and drain on paper towels; While frying, prepare the sauce by mixing soy sauce, gochujang, honey, brown sugar, rice vinegar, minced garlic, grated ginger, sesame oil, and water in a saucepan; Bring the sauce to a simmer over medium heat; Stir constantly until the sugar dissolves and the sauce thickens slightly; Place fried chicken in a large bowl; Pour the hot sauce over the chicken; Toss well to coat evenly; Serve immediately, garnished with sesame seeds and chopped green onions if desired."
    },
    {
        "title": "Sundubu Jjigae",
        "category": "Korean",
        "prepared_by": "Chef Park",
        "prep_time": "10 mins",
        "cook_time": "40 mins",
        "servings": 3,
        "image": "img/sundubu.jpg",
        "description": "Spicy Korean stew made with uncurdled tofu, vegetables, and seafood or meat, served boiling hot with rice.",
        "ingredients": "Soft tofu (silken tofu): 400g;\nPork belly or beef, thinly sliced: 100g;\nKimchi (optional): 1/2 cup, chopped;\nOnion: 1 small, sliced;\nGarlic: 3 cloves, minced;\nGreen chili pepper: 1, sliced;\nGochugaru (Korean red chili flakes): 1 to 2 tbsp;\nGochujang (Korean chili paste): 1 tbsp;\nSoy sauce: 1 tbsp;\nSesame oil: 1 tsp;\nVegetable or anchovy broth: 2 cups;\nSalt: to taste;\nEgg: 1 (optional);\nScallions: 1 stalk, chopped;",
        "instructions": "Heat a Korean earthenware pot or heavy-bottomed saucepan over medium heat; Add sesame oil and sauté minced garlic until fragrant; Add the sliced pork belly or beef and cook until the meat changes color; Add sliced onions and chopped kimchi, stir-frying together for 2-3 minutes; Sprinkle in gochugaru and add gochujang; Mix well so the chili paste and flakes coat the meat and kimchi; Pour in the broth and bring the mixture to a boil; Once boiling, gently add chunks of soft tofu by spoonfuls, breaking some pieces apart but keeping others whole; Add soy sauce and sliced green chili; Let it simmer for about 10 minutes so the flavors meld; Taste and season with salt if necessary; If using, crack an egg into the stew carefully and let it cook for 2-3 minutes until the white is set but yolk remains runny; Finally, sprinkle chopped scallions on top before serving; Serve hot with steamed rice and side dishes.\n"
    },
    {
        "title": "Galbi",
        "category": "Korean",
        "prepared_by": "Chef Liyana",
        "prep_time": "10 mins",
        "cook_time": "1 hour",
        "servings": 3,
        "image": "img/galbi.jpg",
        "description": "Korean BBQ dish of beef short ribs marinated in a sweet soy-based sauce, then grilled to perfection.",
        "ingredients": "Beef short ribs (flanken cut): 1 kg; Soy sauce: 1/2 cup; Brown sugar: 1/4 cup; Sesame oil: 2 tbsp; Garlic: 4 cloves, minced; Ginger: 1 tbsp, grated; Green onions: 3, chopped; Asian pear (or apple): 1/2, grated; Toasted sesame seeds: 1 tbsp; Black pepper: 1/2 tsp; Water: 1/4 cup",
        "instructions": "Prepare the short ribs by rinsing and patting dry; In a large bowl, combine soy sauce, brown sugar, sesame oil, minced garlic, grated ginger, chopped green onions, grated Asian pear, toasted sesame seeds, black pepper, and water; Mix the marinade thoroughly until sugar dissolves and ingredients are well blended; Place the ribs in the marinade, making sure each piece is well coated; Cover and refrigerate for at least 4 hours, preferably overnight, to allow flavors to penetrate; Preheat grill or grill pan over medium-high heat; Remove ribs from marinade and shake off excess; Grill the ribs for about 4-5 minutes on each side, until nicely charred and cooked through but still tender; Let ribs rest for a few minutes before serving; Serve hot with steamed rice and side dishes like kimchi."
    },
    {
        "title": "Gimbap",
        "category": "Korean",
        "prepared_by": "Chef Rahman",
        "prep_time": "15 mins",
        "cook_time": "1 hour",
        "servings": 3,
        "image": "img/gimbap.jpg",
        "description": "Korean dish similar to sushi rolls, made with rice, vegetables, and meats rolled in seaweed and sliced into bite-sized pieces.",
        "ingredients": "Cooked short-grain rice: 3 cups;\nRice vinegar: 2 tbsp;\nSugar: 1 tbsp;\nSalt: 1 tsp;\nRoasted seaweed sheets (nori): 5 sheets;\nCarrot: 1 medium, julienned;\nCucumber: 1 medium, julienned;\nSpinach: 1 bunch;\nEggs: 3;\nImitation crab sticks or cooked beef (optional): 5 sticks or 150g;\nSesame oil: 2 tbsp;\nVegetable oil: 2 tbsp;\nSalt and pepper: to taste;\nSesame seeds: 1 tbsp;",
        "instructions": "Cook rice and while still hot, mix rice vinegar, sugar, and salt in; stir gently to season rice and let cool;\nBlanch spinach in boiling water for 30 seconds; drain and rinse with cold water; squeeze out excess water and season with 1 tsp sesame oil and a pinch of salt; set aside;\nHeat 1 tbsp vegetable oil in a pan; sauté julienned carrots with a pinch of salt until slightly softened; set aside;\nCut cucumber into thin strips; if very watery, lightly salt and drain excess water; set aside;\nBeat eggs with a pinch of salt and pepper; heat a pan with 1 tbsp vegetable oil; make thin omelets by cooking egg mixture in batches; let cool and slice into long strips;\nPrepare crab sticks or cooked beef by slicing into long strips; set aside;\nLay a sheet of seaweed on a bamboo rolling mat; spread a thin, even layer of rice over the seaweed leaving about 2 cm at the top edge free of rice;\nArrange spinach, carrots, cucumber, egg strips, and crab sticks/beef horizontally on the rice near the bottom edge;\nUsing the mat, roll the gimbap tightly from the bottom edge upwards, pressing gently but firmly to hold the roll together; seal the edge with a little water;\nRepeat with remaining ingredients;\nBrush rolls lightly with sesame oil and sprinkle with sesame seeds;\nSlice each roll into 1.5 cm thick pieces using a sharp knife; wipe the knife with a damp cloth between cuts for clean slices;\nServe immediately or wrap and refrigerate for up to a day."
    },
    {
        "title": "Grilled Cheese Sandwich",
        "category": "Western",
        "prepared_by": "Chef Oliver",
        "prep_time": "25 mins",
        "cook_time": "40 mins",
        "servings": 3,
        "image": "img/grilled_cheese.jpg",
        "description": "Comforting snack made by grilling bread slices with melted cheese in the middle, often served with tomato soup.",
        "ingredients": "Bread slices: 2;Butter: 2 tbsp (softened);Cheddar cheese slices: 2 (or grated cheese 1 cup);Optional: Tomato slices 2, Mustard 1 tsp, Black pepper a pinch",
        "instructions": "Spread butter evenly on one side of each bread slice;Place one slice buttered side down on a clean plate or cutting board;Layer the cheese slices evenly on the bread;Add tomato slices and sprinkle black pepper if using;Cover with the second bread slice, buttered side up;Preheat a non-stick skillet or frying pan over medium heat;Place the sandwich carefully on the skillet;Cook for about 3-4 minutes until the bread turns golden brown and crispy;Using a spatula, gently flip the sandwich to the other side;Cook for another 3-4 minutes until the second side is golden brown and the cheese has melted;Remove the sandwich from the pan and let it sit for 1 minute;Cut diagonally and serve warm."
    },
    {
        "title": "Caesar Salad",
        "category": "Western",
        "prepared_by": "Chef Oliver",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 6,
        "image": "img/caesar_salad.jpg",
        "description": "Crisp salad of romaine lettuce, croutons, and Parmesan cheese tossed in Caesar dressing made with anchovies, egg, and lemon.",
        "ingredients": "Romaine lettuce hearts: 2, halved lengthwise;Olive oil: 3 tbsp;Salt: 1 tsp;Black pepper: ½ tsp;Garlic powder: ½ tsp;Parmesan cheese: ½ cup, grated;Caesar dressing: ½ cup;Croutons: 1 cup;Lemon wedges: for serving",
        "instructions": "Preheat your grill to medium-high heat, about 400°F (200°C);Brush the cut sides of the romaine lettuce halves generously with olive oil to prevent sticking and promote charring;Sprinkle salt, black pepper, and garlic powder evenly over the lettuce halves to season;Place the lettuce halves cut side down on the grill;Grill for about 2-3 minutes without moving them, allowing grill marks to form and the lettuce to slightly wilt;Carefully flip the lettuce halves and grill the other side for 1-2 minutes until slightly charred but still crisp;Remove the lettuce from the grill and place on a serving platter cut side up;Drizzle Caesar dressing evenly over the grilled lettuce;Sprinkle grated Parmesan cheese generously on top of the dressed lettuce;Add croutons over the salad for crunch;Serve immediately with lemon wedges on the side to squeeze over for extra brightness"
    },
    {
        "title": "Meatball",
        "category": "Western",
        "prepared_by": "Chef Thomas",
        "prep_time": "25 mins",
        "cook_time": "45 mins",
        "servings": 6,
        "image": "img/meatball.jpg",
        "description": "Seasoned ground meat formed into balls and cooked by frying, baking, or simmering in sauce, often served with pasta.",
        "ingredients": "Ground beef: 500g;\nBreadcrumbs: 1 cup;\nMilk: ½ cup;\nEgg: 1;\nOnion: 1 small, finely chopped;\nGarlic: 2 cloves, minced;\nParmesan cheese: ¼ cup, grated;\nFresh parsley: 2 tbsp, chopped;\nSalt: 1 tsp;\nBlack pepper: ½ tsp;\nOlive oil: 2 tbsp;\nTomato sauce: 400ml;\nWater: ½ cup;",
        "instructions": "Preheat oven to 200°C (400°F);\nIn a small bowl, soak breadcrumbs in milk and let them absorb the liquid for 5 minutes;\nIn a large bowl, combine ground beef, soaked breadcrumbs, egg, chopped onion, minced garlic, grated Parmesan, chopped parsley, salt, and black pepper;\nMix all ingredients gently with your hands or a spoon until just combined;\nShape the mixture into meatballs, about the size of a golf ball;\nHeat olive oil in a large oven-safe skillet over medium heat;\nAdd meatballs carefully and cook for about 3-4 minutes, turning occasionally until browned on all sides;\nPour tomato sauce and water over the meatballs in the skillet;\nTransfer the skillet to the preheated oven and bake for 20 minutes until meatballs are cooked through;\nRemove from oven and let the meatballs rest for 5 minutes before serving;"
    },
    {
        "title": "Mac and Cheese",
        "category": "Western",
        "prepared_by": "Chef Thomas",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/maccheese.jpg",
        "description": "Creamy comfort food made from cooked macaroni pasta and a rich cheese sauce, often baked until bubbly and golden.",
        "ingredients": "Elbow Macaroni: 2 cups; Butter: 4 tbsp; All-purpose Flour: 3 tbsp; Milk (whole or 2%): 2.5 cups; Cheddar Cheese (shredded): 3 cups; Salt: 1 tsp; Black Pepper: 0.5 tsp; Mustard Powder (optional): 0.5 tsp; Paprika (optional): 0.25 tsp",
        "instructions": "Cook macaroni in boiling salted water until just tender but still firm, about 7-8 minutes; Drain macaroni and set aside. In a medium saucepan, melt butter over medium heat; Stir in flour and cook, whisking constantly for 1-2 minutes until mixture is lightly golden and bubbly; Slowly add milk while whisking continuously to avoid lumps. Cook the sauce, stirring often, until it thickens and coats the back of a spoon, about 5-7 minutes; Remove from heat and add shredded cheddar cheese gradually, stirring until fully melted and smooth. Season cheese sauce with salt, black pepper, mustard powder, and paprika if using; Combine drained macaroni and cheese sauce in a large bowl, stirring gently to coat evenly. Serve immediately for creamy mac and cheese or transfer to a baking dish, top with extra cheese or breadcrumbs, and bake at 350°F (175°C) for 20 minutes for a baked version."
    },
    {
        "title": "Roast Chicken",
        "category": "Western",
        "prepared_by": "Chef Julia",
        "prep_time": "10 mins",
        "cook_time": "30 mins",
        "servings": 6,
        "image": "img/roast_chicken.jpg",
        "description": "Whole chicken seasoned and oven-roasted until crispy on the outside and juicy inside, often served with vegetables or potatoes.",
        "ingredients": "Whole chicken: 1.5 kg; Olive oil: 3 tbsp; Garlic cloves: 4, minced; Lemon: 1, halved; Fresh rosemary: 2 sprigs; Salt: 1 tbsp; Black pepper: 1 tsp; Paprika: 1 tsp; Onion: 1 large, quartered; Carrots: 2, cut into chunks; Potatoes: 3 medium, cut into chunks",
        "instructions": "Preheat the oven to 200°C (400°F); Rinse the chicken inside and out and pat dry with paper towels; Rub the chicken all over with olive oil, then season generously with salt, pepper, and paprika; Stuff the cavity with minced garlic, lemon halves, and rosemary sprigs; Place the quartered onion, carrots, and potatoes at the bottom of a roasting pan; Put the chicken on top of the vegetables, breast side up; Tie the legs together with kitchen twine and tuck the wing tips under the body; Roast the chicken in the oven for about 1 hour 15 minutes, or until the internal temperature reaches 75°C (165°F); Halfway through cooking, baste the chicken with the juices from the pan to keep it moist; Remove the chicken from the oven and let it rest for 10-15 minutes before carving; Serve the chicken with the roasted vegetables on the side."
    },
    {
        "title": "Meatloaf",
        "category": "Western",
        "prepared_by": "Chef Gordon",
        "prep_time": "15 mins",
        "cook_time": "1 hour",
        "servings": 4,
        "image": "img/meatloaf.jpg",
        "description": "Savory dish made from ground meat mixed with breadcrumbs and seasonings, shaped into a loaf and baked, often served with gravy or ketchup glaze.",
        "ingredients": "Ground beef: 500g;\nBreadcrumbs: 1 cup;\nMilk: 1/2 cup;\nEggs: 2;\nOnion: 1 medium, finely chopped;\nGarlic: 2 cloves, minced;\nWorcestershire sauce: 2 tbsp;\nKetchup: 1/4 cup;\nSalt: 1 tsp;\nBlack pepper: 1/2 tsp;\nParsley: 2 tbsp, chopped (optional);\nBrown sugar: 2 tbsp;\nMustard: 1 tbsp;\nTomato sauce: 1/4 cup (for topping)",
        "instructions": "Preheat oven to 180°C (350°F);\nIn a large bowl, soak the breadcrumbs in milk for about 5 minutes;\nAdd ground beef, eggs, chopped onion, minced garlic, Worcestershire sauce, salt, pepper, and parsley into the breadcrumb mixture;\nUse your hands or a spoon to mix everything gently but thoroughly;\nIn a separate small bowl, combine ketchup, brown sugar, and mustard to make the glaze;\nPlace the meat mixture into a loaf pan or shape it by hand on a baking tray into a loaf form;\nSpread half of the glaze evenly over the top of the meatloaf;\nBake in the preheated oven for 45 minutes;\nRemove from oven and spread the remaining glaze on top;\nReturn to the oven and bake for another 15 minutes, or until the meatloaf is cooked through and the internal temperature reaches 70°C (160°F);\nLet the meatloaf rest for 10 minutes before slicing and serving."
    },
    {
        "title": "Mashed Potatoes",
        "category": "Western",
        "prepared_by": "Chef Jamie Oliver",
        "prep_time": "10 mins",
        "cook_time": "15 mins",
        "servings": 5,
        "image": "img/mashed_potatoes.jpg",
        "description": "Creamy side dish made by boiling potatoes, then mashing them with butter, milk, and seasoning until smooth.",
        "ingredients": "Potatoes: 1 kg, peeled and cut into chunks; Butter: 4 tbsp; Milk: 1/2 cup, warm; Salt: 1 tsp; Black pepper: 1/2 tsp; Garlic (optional): 2 cloves, minced",
        "instructions": "Place potatoes in a large pot and cover with cold water; Add a pinch of salt to the water; Bring to a boil over medium-high heat; Cook potatoes until they are very tender when pierced with a fork, about 15-20 minutes; Drain the potatoes well in a colander; Return the potatoes to the pot and let them dry for 1-2 minutes on low heat to remove excess moisture; Add butter and minced garlic if using; Begin mashing the potatoes using a potato masher or fork; Gradually add warm milk while mashing to reach your desired creamy texture; Season with salt and black pepper; Taste and adjust seasoning if necessary; Serve warm."
    },
    {
        "title": "Spaghetti Carbonara",
        "category": "Western",
        "prepared_by": "Chef Julia",
        "prep_time": "25 mins",
        "cook_time": "1 hour",
        "servings": 5,
        "image": "img/carbonara.jpg",
        "description": "Italian pasta dish made with eggs, cheese, pancetta, and black pepper, creating a creamy sauce without cream.",
        "ingredients": "Spaghetti: 400g; Pancetta or Guanciale: 150g, diced; Eggs: 3 large; Parmesan cheese: 100g, finely grated; Garlic: 1 clove, peeled; Olive oil: 1 tbsp; Black pepper: freshly ground, to taste; Salt: for pasta water",
        "instructions": "Bring a large pot of salted water to a boil; Add the spaghetti and cook until al dente according to package instructions, usually about 8-10 minutes; While the pasta cooks, heat olive oil in a pan over medium heat; Add the garlic clove and sauté for 1-2 minutes until fragrant, then remove the garlic; Add the diced pancetta or guanciale to the pan; Cook, stirring occasionally, until the meat is crisp and golden, about 5-7 minutes; In a bowl, whisk together the eggs, grated Parmesan cheese, and a generous amount of freshly ground black pepper; When the pasta is done, reserve about a cup of the pasta cooking water and then drain the spaghetti; Quickly add the hot pasta to the pan with the cooked pancetta; Remove the pan from heat to avoid scrambling the eggs; Pour the egg and cheese mixture over the pasta; Toss vigorously and continuously to create a creamy sauce, adding reserved pasta water little by little to reach desired consistency; Serve immediately with extra Parmesan and black pepper on top."
    },
    {
        "title": "Fish and Chips",
        "category": "Western",
        "prepared_by": "Chef Jamie Oliver",
        "prep_time": "25 mins",
        "cook_time": "40 mins",
        "servings": 4,
        "image": "img/fishchips.jpg",
        "description": "British classic of battered and fried fish served with thick-cut fries, often accompanied by tartar sauce and mushy peas.",
        "ingredients": "White fish fillets (cod or haddock): 500g;\nAll-purpose flour: 150g;\nCornstarch: 50g;\nBaking powder: 1 tsp;\nCold sparkling water: 200ml;\nSalt: 1 tsp;\nBlack pepper: ½ tsp;\nPotatoes: 4 large, peeled;\nVegetable oil (for frying): enough for deep frying;\nLemon wedges: to serve;\nTartar sauce: to serve (optional)",
        "instructions": "Peel potatoes and cut into thick chips; rinse them under cold water to remove excess starch; dry thoroughly with a clean kitchen towel;\nHeat oil in a deep fryer or large, heavy pan to 130°C (266°F); fry the chips in batches for 4-5 minutes until soft but not colored; remove and drain on paper towels;\nIncrease oil temperature to 180°C (356°F); prepare batter by mixing flour, cornstarch, baking powder, salt, and pepper in a bowl; gradually whisk in cold sparkling water until smooth and thick;\nPat fish fillets dry with paper towels; season lightly with salt and pepper; dip each fillet into the batter, ensuring It is completely coated;\nCarefully lower the battered fish into the hot oil; fry for about 5-7 minutes or until golden brown and crispy; remove with a slotted spoon and drain on paper towels;\nReturn the chips to the hot oil in batches; fry for another 2-3 minutes until golden and crispy; drain on paper towels;\nServe the crispy fish and chips hot with lemon wedges and tartar sauce on the side; enjoy immediately for best texture and flavor."
    },
    {
        "title": "Quiche",
        "category": "Western",
        "prepared_by": "Chef Gordon",
        "prep_time": "15 mins",
        "cook_time": "40 mins",
        "servings": 5,
        "image": "img/quiche.jpg",
        "description": "Savory French tart made with a flaky pastry crust filled with a creamy egg custard, cheese, vegetables, or meat.",
        "ingredients": "Pie crust (store-bought or homemade): 1; Eggs: 4 large; Heavy cream or whole milk: 1 cup; Shredded cheese (Gruyère, cheddar, or Swiss): 1 cup; Cooked bacon or ham (optional): 1/2 cup, chopped; Onion: 1 small, finely chopped; Salt: 1/2 tsp; Black pepper: 1/4 tsp; Nutmeg (optional): a pinch; Olive oil or butter: 1 tbsp; Fresh spinach or other veggies (optional): 1/2 cup, chopped",
        "instructions": "Preheat your oven to 375°F (190°C); Place the pie crust into a 9-inch tart or pie pan and prick the bottom lightly with a fork; Line the crust with parchment paper and fill with pie weights or dried beans; Bake the crust for 10-12 minutes until lightly golden; Remove parchment and weights and set crust aside; Heat olive oil or butter in a skillet over medium heat; Sauté the chopped onion until translucent, about 3-4 minutes; If using vegetables like spinach, add them now and cook until wilted; Let the filling cool slightly; In a mixing bowl, whisk together eggs, cream or milk, salt, pepper, and nutmeg until smooth; Stir in the shredded cheese and cooked bacon or ham if using; Spread the sautéed onions and veggies evenly over the baked crust; Pour the egg mixture carefully on top; Place the quiche in the oven and bake for 30-35 minutes, or until the filling is set and slightly golden on top; Let the quiche cool for about 10 minutes before slicing and serving."
    },
    {
        "title": "Pad Thai",
        "category": "Thai",
        "prepared_by": "Chef Kenji",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/pad_thai.jpg",
        "description": "Thai stir-fried noodle dish made with rice noodles, shrimp or chicken, tofu, eggs, and peanuts in a tangy tamarind sauce.",
        "ingredients": "Rice noodles (soaked in warm water for 30 min): 200g;\nShrimp (peeled and deveined): 150g;\nFirm tofu (cut into small cubes): 100g;\nEggs: 2;\nGarlic (minced): 3 cloves;\nGreen onions (chopped): 2;\nBean sprouts: 1 cup;\nPeanuts (crushed): ¼ cup;\nLime (cut into wedges): 1;\nVegetable oil: 3 tbsp;\nTamarind paste: 2 tbsp;\nFish sauce: 3 tbsp;\nPalm sugar or brown sugar: 2 tbsp;\nChili powder: 1 tsp (adjust to taste);",
        "instructions": "Prepare the sauce by mixing tamarind paste, fish sauce, palm sugar, and chili powder in a bowl until sugar dissolves;\nHeat 2 tbsp of oil in a large pan or wok over medium-high heat;\nAdd minced garlic and stir-fry briefly until fragrant but not burnt;\nAdd tofu cubes and shrimp; cook until shrimp turns pink and tofu is lightly browned;\nPush ingredients to one side, add the remaining 1 tbsp oil and crack in the eggs; scramble gently until cooked;\nAdd the soaked noodles, pour the sauce over, and toss everything together;\nContinue to stir-fry for about 2-3 minutes, ensuring noodles are evenly coated and heated through;\nAdd bean sprouts and green onions; toss quickly to combine without overcooking the sprouts;\nTurn off heat and serve immediately;\nTop with crushed peanuts and lime wedges on the side for squeezing over before eating."
    },
    {
        "title": "Green Curry",
        "category": "Thai",
        "prepared_by": "Chef Chumpol",
        "prep_time": "10 mins",
        "cook_time": "40 mins",
        "servings": 2,
        "image": "img/green_curry.jpg",
        "description": "Spicy Thai curry made with green curry paste, coconut milk, vegetables, and meat or tofu, served with jasmine rice.",
        "ingredients": "Chicken breast (cut into bite-size pieces): 500g;\nGreen curry paste: 3 tbsp;\nCoconut milk: 400ml;\nThai eggplants (quartered) or regular small eggplants: 5-6;\nKaffir lime leaves: 3-4;\nFish sauce: 2 tbsp;\nPalm sugar or brown sugar: 1 tbsp;\nThai basil leaves: a handful;\nRed chili (sliced, optional): 1;\nVegetable oil: 2 tbsp;\nWater or chicken broth: 100ml;\nFresh coriander (for garnish, optional): a few sprigs",
        "instructions": "Heat oil in a wok or large pan over medium heat; add green curry paste and stir-fry gently for about 1-2 minutes until fragrant; Add about half of the coconut milk and stir to mix with the curry paste; Bring it to a gentle simmer and cook for 3-4 minutes until the oil begins to separate from the paste; Add chicken pieces and stir well to coat with the curry paste; Cook the chicken for 5 minutes until it starts to change color; Add the remaining coconut milk and water or broth; Stir and bring to a gentle boil; Add the quartered eggplants and kaffir lime leaves; Stir in fish sauce and palm sugar; Let the curry simmer for 10-12 minutes until the chicken is cooked through and eggplants are tender; Taste the curry and adjust seasoning by adding more fish sauce or sugar if needed; Turn off the heat and stir in the Thai basil leaves and sliced red chili; Serve hot, garnished with fresh coriander if desired."
    },
    {
        "title": "Tom Yum Soup",
        "category": "Thai",
        "prepared_by": "Chef Jisoo",
        "prep_time": "25 mins",
        "cook_time": "30 mins",
        "servings": 3,
        "image": "img/tomyum.jpg",
        "description": "Hot and sour Thai soup made with lemongrass, kaffir lime leaves, chili, and shrimp or chicken in a clear broth.",
        "ingredients": "Water or chicken stock: 4 cups;\nLemongrass: 2 stalks, cut into 2-inch pieces and smashed;\nKaffir lime leaves: 5 leaves, torn;\nGalangal: 3 slices;\nBirds eye chilies: 3-5, smashed;\nShallots: 3, sliced;\nMushrooms: 1 cup, sliced (straw mushrooms or button mushrooms);\nTomatoes: 1 medium, cut into wedges;\nFish sauce: 3 tbsp;\nLime juice: 3 tbsp;\nSugar: 1 tsp;\nShrimp (peeled and deveined): 200g;\nFresh cilantro: a handful, chopped;\nOptional: Thai chili paste (Nam Prik Pao): 1 tbsp\n",
        "instructions": "Bring water or chicken stock to a boil in a pot; Add lemongrass, kaffir lime leaves, galangal, birds eye chilies, and shallots to the boiling water; Let the broth simmer gently for 5-7 minutes to infuse all the flavors; Add the mushrooms and tomato wedges; Continue simmering for 3-4 minutes until the mushrooms are tender; Add the shrimp to the pot and cook for 2-3 minutes or until they turn pink and opaque; Season the soup with fish sauce, lime juice, and sugar; Stir well and taste to adjust the seasoningbalance sour, salty, and sweet as you prefer; If using, stir in the Thai chili paste for extra flavor and heat; Turn off the heat; Garnish with chopped fresh cilantro before serving; Serve hot with steamed rice or enjoy as is."
    },
    {
        "title": "Mango Sticky Rice",
        "category": "Thai",
        "prepared_by": "Chef Anand",
        "prep_time": "15 mins",
        "cook_time": "40 mins",
        "servings": 4,
        "image": "img/mango_rice.jpg",
        "description": "Thai dessert of glutinous rice soaked in sweet coconut milk, served with ripe mango slices and sometimes sesame seeds.",
        "ingredients": "Glutinous rice (sticky rice): 1 cup;\nCoconut milk: 1 cup;\nSugar: 1/2 cup;\nSalt: 1/4 tsp;\nRipe mangoes: 2;\nToasted sesame seeds or mung beans (optional): 2 tbsp",
        "instructions": "Rinse the glutinous rice under cold water until the water runs clear; Soak the rice in water for at least 4 hours or overnight for best texture; Drain the rice and steam it in a bamboo steamer or a regular steamer lined with cheesecloth for about 20-25 minutes until tender; While the rice is steaming, combine coconut milk, sugar, and salt in a saucepan; Heat gently over low heat, stirring until sugar dissolves completely; Do not let the coconut milk boil; Once the rice is cooked, transfer it to a large bowl; Pour about 3/4 of the sweetened coconut milk over the hot rice; Stir gently to combine and let the rice absorb the coconut milk for 15-20 minutes; Peel the mangoes and slice them thinly; To serve, place a portion of the sticky rice on a plate; Arrange mango slices beside the rice; Drizzle the remaining coconut milk over the top; Sprinkle toasted sesame seeds or mung beans for added texture and garnish if desired; Serve warm or at room temperature."
    },
    {
        "title": "Papaya Salad",
        "category": "Thai",
        "prepared_by": "Chef Chumpol",
        "prep_time": "25 mins",
        "cook_time": "30 mins",
        "servings": 2,
        "image": "img/somtam.jpg",
        "description": "Known as Som Tam is a spicy Thai salad made with shredded green papaya, tomatoes, peanuts, chili, and lime juice, often paired with sticky rice.",
        "ingredients": "Green papaya (shredded): 2 cups; Cherry tomatoes: 10, halved; Green beans: 6-8, cut into 1-inch pieces; Garlic cloves: 2; Thai birds eye chilies: 2-3 (adjust to taste); Palm sugar: 1 tbsp (or brown sugar); Fish sauce: 2 tbsp; Lime juice: 2 tbsp; Roasted peanuts: 2 tbsp, crushed; Dried shrimp (optional): 1 tbsp; Carrot (shredded): ½ cup",
        "instructions": "Peel the green papaya and carrot; shred them finely using a grater or a julienne peeler; Set aside in a large bowl; Pound garlic and chilies in a mortar and pestle until roughly crushed; Add palm sugar and continue pounding until it dissolves slightly; Stir in fish sauce and lime juice; Mix well to balance sweet, salty, sour, and spicy flavors; Add cherry tomatoes, green beans, dried shrimp (if using), and shredded papaya and carrot; Toss everything together thoroughly using a spoon and fork or your hands; Taste and adjust seasoning by adding more lime juice, fish sauce, or sugar if needed; Finally, sprinkle crushed roasted peanuts on top before serving; Serve immediately for the best fresh crunch and flavor.\n"
    },
    {
        "title": "Pandan Chicken",
        "category": "Thai",
        "prepared_by": "Chef Ian",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/pandan_chicken.jpg",
        "description": "Thai dish where marinated chicken is wrapped in pandan leaves and deep-fried, giving it a fragrant aroma and juicy texture.",
        "ingredients": "Chicken thighs (boneless, skin-on): 1 kg; Pandan leaves: 20-25 pieces; Garlic: 5 cloves; Shallots: 3; Coriander powder: 1 tbsp; Turmeric powder: 1 tsp; White pepper powder: 1 tsp; Soy sauce: 2 tbsp; Oyster sauce: 1 tbsp; Sugar: 1 tsp; Salt: 1 tsp; Coconut milk: 100 ml; Cooking oil: 2 tbsp",
        "instructions": "Peel garlic and shallots; finely mince both;In a bowl, combine minced garlic, shallots, coriander powder, turmeric powder, white pepper, soy sauce, oyster sauce, sugar, salt, and coconut milk; Stir well to make the marinade;Cut chicken into medium-sized pieces; add to the marinade; mix thoroughly so all pieces are coated;Cover the bowl; refrigerate and marinate for at least 2 hours or overnight for best flavor; Take one pandan leaf; place a marinated chicken piece on the leafs end; roll tightly and secure with a toothpick or kitchen twine; Repeat until all chicken pieces are wrapped;Heat cooking oil in a frying pan over medium heat; Carefully add the pandan-wrapped chicken; Fry for about 7-10 minutes on each side or until the chicken is cooked through and golden brown; Remove from oil and drain excess oil on paper towels; Serve hot with steamed rice or as a snack."
    },
    {
        "title": "Thai Basil Chicken",
        "category": "Thai",
        "prepared_by": "Chef Bee Satongun",
        "prep_time": "25 mins",
        "cook_time": "15 mins",
        "servings": 2,
        "image": "img/thai_basil.jpg",
        "description": "Stir-fried Thai dish made with ground chicken, garlic, chili, and holy basil, served over rice with a fried egg.",
        "ingredients": "Chicken (minced or chopped): 500g; Garlic: 4 cloves, minced; Fresh Thai birds eye chilies: 3-5, sliced (adjust to taste); Onion: 1 small, sliced; Vegetable oil: 2 tbsp; Soy sauce: 2 tbsp; Fish sauce: 1 tbsp; Oyster sauce: 1 tbsp; Sugar: 1 tsp; Fresh Thai basil leaves: 1 cup; Cooked jasmine rice: to serve",
        "instructions": "Heat oil in a wok or large frying pan over medium-high heat; Add minced garlic and sliced chilies; stir-fry quickly until fragrant, about 30 seconds; Add sliced onion and cook until slightly softened, about 2 minutes; Add the minced chicken; break it apart with a spatula; stir-fry until the chicken is cooked through and no longer pink, about 5 minutes; Add soy sauce, fish sauce, oyster sauce, and sugar; stir everything together well so the chicken is evenly coated with the sauce; Cook for another 2 minutes to allow the flavors to blend; Turn off the heat and immediately add the fresh basil leaves; stir gently until the basil is wilted and fragrant; Serve hot over steamed jasmine rice.\n"
    },
    {
        "title": "Pineapple Fried Rice",
        "category": "Thai",
        "prepared_by": "Chef Ian",
        "prep_time": "10 mins",
        "cook_time": "30 mins",
        "servings": 6,
        "image": "img/pineapple.jpg",
        "description": "Thai-style fried rice dish stir-fried with pineapple chunks, vegetables, shrimp or chicken, and curry powder.",
        "ingredients": "Cooked Jasmine Rice (preferably day-old): 3 cups;Pineapple (fresh, diced): 1 cup;Shrimp or Chicken (optional, cooked): 200g;Eggs: 2, beaten;Carrot (diced): ½ cup;Green Peas: ½ cup;Cashew Nuts: ¼ cup;Garlic (minced): 3 cloves;Onion (chopped): 1 small;Spring Onion (sliced): 2 stalks;Soy Sauce: 2 tbsp;Fish Sauce: 1 tbsp;Curry Powder: 1 tsp;Salt: to taste;White Pepper: ¼ tsp;Oil: 2 tbsp",
        "instructions": "Heat oil in a large pan or wok over medium heat;Add cashew nuts and stir-fry until golden brown, then remove and set aside.\nAdd more oil if needed;Sauté chopped onion and minced garlic until fragrant.\nPush the onion and garlic to the side;Pour in the beaten eggs and scramble until cooked through.\nAdd cooked shrimp or chicken if using;Stir-fry together for 2 minutes to heat through.\nAdd diced carrots and peas;Cook for another 2 to 3 minutes until vegetables are tender but still crisp.\nAdd the cold cooked rice;Break up any clumps with a spatula and stir well to combine with other ingredients.\nSprinkle in curry powder, soy sauce, fish sauce, salt, and white pepper;Mix thoroughly so the rice is evenly coated and colored.\nToss in diced pineapple and previously fried cashew nuts;Cook for another 2 to 3 minutes, stirring gently to avoid mashing the pineapple.\nAdd sliced spring onions;Give a final stir and remove from heat."
    },
    {
        "title": "Thai-style Grilled Beef with Dipping Sauce",
        "category": "Thai",
        "prepared_by": "Chef Bee Satongun",
        "prep_time": "10 mins",
        "cook_time": "40 mins",
        "servings": 2,
        "image": "img/thai_beef.jpg",
        "description": "(Nam Tok) features grilled beef slices tossed with herbs and spices, served with a tangy lime-chili dipping sauce.",
        "ingredients": "Beef Flank Steak: 500g;Soy Sauce: 2 tbsp;Oyster Sauce: 2 tbsp;Fish Sauce: 1 tbsp;Palm Sugar (or Brown Sugar): 1 tbsp;Ground Black Pepper: 1 tsp;Garlic: 3 cloves, minced;Coriander Root: 2 roots, finely chopped;Lime Juice: 2 tbsp;Chili Flakes: 1 tsp (adjust to taste);Shallots: 2, thinly sliced;Fresh Coriander Leaves: a handful, chopped;Sticky Rice (toasted and ground): 1 tbsp (optional, for sauce);Oil: 1 tbsp",
        "instructions": "Mix soy sauce, oyster sauce, fish sauce, palm sugar, ground black pepper, minced garlic, and chopped coriander root in a bowl;Add beef to the marinade and coat thoroughly;Cover and refrigerate for at least 1 hour, preferably overnight\nPreheat a grill pan or outdoor grill over medium-high heat;Brush beef with a little oil before grilling\nGrill beef for about 3 to 4 minutes on each side for medium doneness, or longer if preferred;Let the beef rest for 10 minutes after grilling to retain its juices\nWhile resting, prepare the dipping sauce by mixing lime juice, fish sauce, palm sugar, chili flakes, sliced shallots, chopped coriander, and ground toasted rice in a bowl;Stir well until sugar dissolves and all ingredients are combined\nSlice beef thinly against the grain before serving;Serve with dipping sauce and sticky rice or steamed vegetables on the side"
    },
    {
        "title": "Thai Fish Cakes",
        "category": "Thai",
        "prepared_by": "Chef Anand",
        "prep_time": "10 mins",
        "cook_time": "40 mins",
        "servings": 5,
        "image": "img/thai_fishcake.jpg",
        "description": "Savory patties made from minced fish, red curry paste, and herbs, fried until golden and served with a sweet chili dipping sauce.",
        "ingredients": "White fish fillet (e.g. cod or tilapia): 500g;Red curry paste: 2 tbsp;Fish sauce: 1 tbsp;Egg: 1;Green beans: 50g, finely sliced;Kaffir lime leaves: 4, finely shredded;Sugar: 1 tsp;Cornstarch: 1 tbsp;Oil: for frying",
        "instructions": "Cut the fish fillets into chunks and place them in a food processor;Add red curry paste, fish sauce, egg, sugar, and cornstarch to the processor;Blend the mixture until it becomes a smooth, sticky paste;Transfer the paste to a bowl and mix in the sliced green beans and shredded kaffir lime leaves using a spoon or your hands;Wet your hands to prevent sticking, then form the paste into small, flat patties about 2 inches wide;Heat oil in a deep pan over medium heat until hot;Fry the fish cakes in batches, cooking each side for about 2 to 3 minutes or until golden brown;Remove and drain on paper towels;Serve hot with sweet chili dipping sauce."
    },
    {
        "title": "Ayam Penyet",
        "category": "Indo",
        "prepared_by": "Chef Juna",
        "prep_time": "20 mins",
        "cook_time": "50 mins",
        "servings": 4,
        "image": "img/ayam_penyet.jpg",
        "description": "Popular Indonesian dish featuring deep-fried chicken thats smashed to tenderize the meat, then served with spicy sambal, fresh cucumber, fried tofu, and tempeh. Originating from East Java, this dish is known for its crispy texture and bold, fiery flavors.",
        "ingredients": "Whole chicken or chicken pieces (about 1 kg); Turmeric powder: 1 tbsp; Garlic: 5 cloves; Shallots: 4; Salt: 1 tsp; Water: enough to boil chicken; Cooking oil: for frying;Red chilies: 6 to 8 (adjust to your spice level); Birds eye chilies: 2 (optional, for extra heat); Shallots: 3; Garlic: 3 cloves; Tomatoes: 1 medium; Salt: to taste; Sugar: 1 tsp; Lime juice: 1 tbsp; Cooking oil: 2 tbsp",
        "instructions": "Prepare the chicken by cleaning it thoroughly; rub turmeric powder and salt all over the chicken; boil the chicken in enough water until fully cooked and tender, about 25-30 minutes; drain and let it cool slightly.\nWhile the chicken is boiling, prepare the sambal by roughly chopping the red chilies, birds eye chilies, shallots, garlic, and tomato.\nHeat oil in a pan and sauté the chopped shallots and garlic until fragrant and golden; add the chilies and tomato and cook until soft; remove from heat and let cool slightly.\nGrind or blend the cooked chili mixture using a mortar and pestle or blender, adding salt and sugar; adjust seasoning to taste; stir in lime juice for freshness.\nAfter the chicken is cool enough to handle, deep-fry it in hot oil until the skin is crispy and golden brown; remove and drain on paper towels.\nServe the fried chicken hot, smashed lightly with a pestle or the back of a spoon to tenderize; accompany with fresh cucumber slices, fried tofu, rice, and the prepared sambal on the side.\n"
    },
    {
        "title": "Ayam Masak Ungkep",
        "category": "Indo",
        "prepared_by": "Chef Degan",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 4,
        "image": "img/ayam_ungkep.jpg",
        "description": "Javanese-style braised chicken dish simmered in a rich blend of ground spices including coriander, garlic, turmeric, and galangal. The chicken is slow-cooked until tender, allowing the spices to fully infuse, and is often fried briefly before serving.",
        "ingredients": "Chicken (cut into medium pieces): 1kg;Shallots: 6 cloves;Garlic: 5 cloves;Coriander seeds: 1 tbsp;Cumin seeds: 1 tsp;Fennel seeds: 1 tsp;Turmeric powder: 1 tsp;Galangal: 1 inch;Ginger: 1 inch;Bay leaves: 2;Lemongrass (bruised): 1 stalk;Water: 400ml;Salt: to taste;Sugar: 1 tsp;Oil: 2 tbsp",
        "instructions": "Toast coriander, cumin, and fennel seeds in a dry pan until fragrant, then grind into powder;Blend shallots, garlic, ginger, galangal, and the ground spices into a smooth paste;Heat oil in a pan and sauté the blended paste until fragrant and the oil separates from the paste;Add chicken pieces and stir to coat evenly with the spices;Add turmeric powder, bay leaves, lemongrass, salt, and sugar, then stir to combine;Pour in water, cover the pan, and simmer over low heat for 30 to 40 minutes until the chicken is tender and the gravy thickens;Uncover and increase heat to medium if you want to reduce the sauce further or lightly brown the chicken before serving"
    },
    {
        "title": "Ayam Gepuk",
        "category": "Indo",
        "prepared_by": "Chef Marinka",
        "prep_time": "15 mins",
        "cook_time": "40 mins",
        "servings": 4,
        "image": "img/ayam_gepuk.jpg",
        "description": "Central Javanese fried chicken dish where the boiled chicken is smashed, then topped with hot chili sambal thats sautéed in oil. It is known for its soft, juicy interior, crispy edges, and intensely spicy sambal that coats every bite.",
        "ingredients": "Chicken (whole or cut): 1kg;Water: enough to boil chicken;Salt: 1 tsp;Turmeric powder: 1 tsp;Cooking oil: for frying;Red chilies (big): 10 pcs;Birds eye chilies: 10 pcs;Garlic: 6 cloves;Shallots: 6 pcs;Salt: to taste;Sugar: 1 tsp;Chicken broth: 4 tbsp;Cooking oil: 3 tbsp",
        "instructions": "Boil chicken with salt and turmeric until fully cooked;Drain and let cool slightly;Fry chicken until skin is crispy and golden, then set aside;\nBoil both red chilies and birds eye chilies until soft, then drain;Pound or blend chilies, garlic, and shallots into a coarse paste;Heat oil in a pan and sauté the paste until fragrant;\nAdd salt and sugar, then pour in chicken broth;Simmer sambal until slightly thickened;\nPlace fried chicken on a flat surface and press (gepok) with pestle or heavy object to flatten slightly and absorb sambal better;Spoon hot sambal over the chicken evenly before serving."
    },
    {
        "title": "Soto Ayam",
        "category": "Indo",
        "prepared_by": "Chef Juna",
        "prep_time": "15 mins",
        "cook_time": "25 mins",
        "servings": 5,
        "image": "img/soto.jpg",
        "description": "Comforting Indonesian chicken soup made with turmeric-spiced broth, shredded chicken, vermicelli, boiled egg, and crispy shallots. Often enjoyed with rice or compressed rice cakes, It is a beloved street food known for its warmth and depth of flavor.",
        "ingredients": "Chicken: 1 whole (about 1.2 kg), cut into pieces;Water: 2 liters;Lemongrass: 2 stalks, smashed;Kaffir Lime Leaves: 4;Bay Leaves: 2;Galangal: 1 inch, smashed;Turmeric Powder: 1 tsp;Coriander Powder: 2 tsp;Cumin Powder: 1 tsp;Salt: to taste;Oil: 3 tbsp;Shallots: 6;Garlic: 4 cloves;Candlenuts: 3 (or substitute with macadamia);Ginger: 1 inch;Fresh Turmeric (or 1 tsp powder): 1 inch;Vermicelli noodles: 100g, soaked and boiled;Boiled eggs: 2, halved;Bean sprouts: 1 cup, blanched;Fried shallots: 3 tbsp;Spring onions: 2 stalks, sliced;Lime wedges: 2;Sambal: optional",
        "instructions": "Blend shallots, garlic, candlenuts, ginger, and turmeric into a smooth paste;Heat oil in a large pot over medium heat and sauté the spice paste until fragrant, about 4 to 5 minutes. Stir continuously to avoid burning;Add lemongrass, kaffir lime leaves, bay leaves, and galangal. Continue sautéing for another 2 minutes until the herbs are aromatic;Add chicken pieces into the pot. Stir well to coat them with the spices. Let the chicken brown slightly for 5 to 7 minutes;Pour in water and bring to a boil. Skim off any foam or impurities that rise to the surface to keep the broth clear;Add turmeric powder, coriander powder, cumin powder, and salt. Stir and reduce the heat to low. Cover and simmer for 45 to 60 minutes until the chicken is cooked through and tender;Remove the chicken from the pot. Let it cool slightly, then shred the meat into bite-sized pieces and discard the bones;Strain the broth if you want it clear. Return the shredded chicken to the pot and keep warm over low heat;To serve, place some vermicelli noodles, bean sprouts, and shredded chicken in a bowl. Pour hot broth over;Top with boiled egg halves, fried shallots, and spring onions. Squeeze lime juice over before eating. Add sambal if you like it spicy"
    },
    {
        "title": "Bakso",
        "category": "Indo",
        "prepared_by": "Chef Wongso",
        "prep_time": "20 mins",
        "cook_time": "40 mins",
        "servings": 3,
        "image": "img/bakso.jpg",
        "description": "Indonesian meatball soup featuring bouncy beef or chicken meatballs served in a savory broth with noodles, tofu, and vegetables. Often sold by street vendors, bakso is a hearty and affordable comfort food enjoyed across the country.",
        "ingredients": "Ground Beef: 500g;Tapioca Flour: 100g;Garlic: 4 cloves, minced;White Pepper: 1 tsp;Salt: 2 tsp;Ice Cubes: 6 pieces;Cold Water: 100ml;Egg: 1;Beef Bones: 500g (for broth);Shallots: 4, sliced;Garlic: 3 cloves, smashed;Leek: 1 stalk, sliced;Water: 2 liters;Salt: to taste;Noodles: as needed;Fried Shallots: for garnish;Celery: chopped, for garnish;Soy Sauce: to taste;Chili Sauce: to taste",
        "instructions": "Place ground beef, tapioca flour, garlic, white pepper, salt, egg, and ice cubes into a food processor;Blend until smooth and sticky;Add cold water little by little if mixture is too dry;Boil water in a large pot until it simmers;Wet your hands, shape the beef mixture into balls using your palms or a spoon;Drop the meatballs gently into the simmering water;Wait until the meatballs float, then cook for another 3 to 5 minutes;Remove and set aside the meatballs\n\nIn a separate pot, prepare the broth;Boil 2 liters of water and add beef bones;Skim the surface to remove scum;Add shallots, smashed garlic, leek, and salt;Simmer for 1 to 2 hours until flavorful;Strain the broth and keep it warm\n\nTo serve, place noodles in a bowl and add several meatballs;Ladle hot broth over them;Garnish with fried shallots and chopped celery;Serve with soy sauce and chili sauce on the side for extra flavor"
    },
    {
        "title": "Sate Madura",
        "category": "Indo",
        "prepared_by": "Chef Degan",
        "prep_time": "25 mins",
        "cook_time": "45 mins",
        "servings": 3,
        "image": "img/sate_madura.jpg",
        "description": "Grilled meat skewer dish from Madura Island, typically made with chicken or beef marinated in spices and served with a rich, sweet-spicy peanut sauce. It is often paired with rice cakes (lontong) and is a staple in Indonesian street food culture.",
        "ingredients": "Chicken thighs (boneless, skinless): 1 kg, cut into small cubes;Sweet soy sauce (kecap manis): 6 tbsp;Garlic: 5 cloves, minced;Shallots: 6, finely chopped;Candlenuts: 3, toasted and crushed;Coriander powder: 1 tsp;Palm sugar (or brown sugar): 1 tbsp, grated;Salt: 1 tsp;Cooking oil: 2 tbsp;Skewers: 15 to 20, soaked in water;Roasted peanuts: 150 g, ground;Garlic: 3 cloves;Red chilies: 3, seeded (optional for less heat);Sweet soy sauce: 3 tbsp;Tamarind paste: 1 tsp;Salt: 1/2 tsp;Sugar: 1 tsp;Water: 200 ml;Cooking oil: 1 tbsp",
        "instructions": "Make the marinade by blending garlic, shallots, candlenuts, coriander powder, palm sugar, salt, and oil into a paste;Mix the paste with sweet soy sauce in a bowl;Add chicken pieces and coat evenly;Cover and marinate in the fridge for at least 2 hours or overnight\n\nThread marinated chicken onto skewers;Preheat grill or charcoal fire to medium heat;Grill skewers while brushing occasionally with leftover marinade mixed with a little oil;Turn skewers frequently;Cook until chicken is browned and cooked through\n\nTo make peanut sauce, blend garlic, red chilies, and peanuts until smooth;Heat oil in a pan;Sauté blended mixture until fragrant;Add water, sweet soy sauce, tamarind paste, sugar, and salt;Stir and simmer until sauce thickens\n\nServe satay hot with a generous spoonful of peanut sauce;Optionally, serve with rice cakes (lontong) and sliced shallots on the side"
    },
    {
        "title": "Pecel Lele",
        "category": "Indo",
        "prepared_by": "Chef Juna",
        "prep_time": "15 mins",
        "cook_time": "40 mins",
        "servings": 4,
        "image": "img/pecel_lele.jpg",
        "description": "Traditional East Javanese meal consisting of deep-fried catfish served with sambal, fresh vegetables, and rice. Simple yet flavorful, the crispy fish and spicy chili paste make it a beloved and affordable dish across Indonesia.",
        "ingredients": "Catfish (Lele): 4 whole, cleaned;Salt: 1 tsp;Lime: 1, juiced;Oil: for deep frying;Red chilies: 10 pcs;Birds eye chilies: 5 pcs;Tomatoes: 2 medium, chopped;Shallots: 5 pcs;Garlic: 3 cloves;Tamarind paste: 1 tsp;Salt: 1 tsp;Sugar: 1 tsp;Oil: 2 tbsp;Steamed rice: as needed;Fresh basil leaves: a handful;Cucumber: 1, sliced;Fried tofu or tempeh: as preferred",
        "instructions": "Rub catfish with lime juice and salt;Let it sit for 15 minutes to remove the fishy smell;Rinse under cold water and pat dry.\nHeat oil in a deep pan over medium heat;Fry catfish until golden brown and crispy on both sides;Drain on paper towels.\nHeat 2 tbsp of oil in a small pan;Sauté shallots, garlic, chilies, and tomatoes until softened and slightly charred;Remove from heat.\nTransfer sautéed ingredients to a mortar or food processor;Add tamarind paste, salt, and sugar;Grind or blend into a coarse sambal paste.\nServe fried catfish with sambal on the side or on top;Add steamed rice, fresh basil, cucumber slices, and fried tofu or tempeh to complete the dish."
    },
    {
        "title": "Gado Gado",
        "category": "Indo",
        "prepared_by": "Chef Marinka",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "servings": 2,
        "image": "img/gado.jpg",
        "description": "Mixed vegetable salad served with boiled egg, tofu, tempeh, and lontong, all topped with a creamy peanut sauce. This hearty dish is both nutritious and flavorful, offering a perfect balance of sweetness, spice, and crunch.",
        "ingredients": "Boiled Potatoes: 2, medium-sized, peeled and cubed;Blanched Cabbage: 1 cup, shredded;Blanched Long Beans: 1 cup, cut into 2-inch lengths;Bean Sprouts: 1 cup, blanched;Cucumber: 1, sliced;Tofu: 200g, fried and cubed;Tempeh: 200g, fried and sliced;Hard-Boiled Eggs: 2, halved;Lontong (rice cakes): 1 cup, sliced;Fried Shallots: 2 tbsp;Prawn Crackers: as desired;Peanuts: 200g, roasted;Garlic: 2 cloves;Red Chilies: 2 (adjust to taste);Palm Sugar: 1 tbsp (or brown sugar);Tamarind Paste: 1 tsp;Salt: to taste;Water: 1 cup;Sweet Soy Sauce (Kecap Manis): 2 tbsp;Cooking Oil: 1 tbsp",
        "instructions": "Blend roasted peanuts, garlic, red chilies, palm sugar, tamarind paste, and salt until smooth;Add water gradually while blending until you reach a thick but pourable consistency.\n\nHeat oil in a saucepan;Pour the blended mixture into the pan and cook over medium heat;Stir continuously to prevent burning.\n\nAdd sweet soy sauce;Continue to cook the sauce for 5 to 7 minutes until it thickens and becomes aromatic;Remove from heat and let it cool slightly.\n\nArrange boiled potatoes, blanched cabbage, long beans, bean sprouts, cucumber, tofu, tempeh, and rice cakes on a large serving plate;Top with halved hard-boiled eggs.\n\nPour generous amounts of peanut sauce over the salad;Sprinkle with fried shallots and serve with prawn crackers on the side."
    },
    {
        "title": "Mie Aceh",
        "category": "Indo",
        "prepared_by": "Chef Wongso",
        "prep_time": "15 mins",
        "cook_time": "35 mins",
        "servings": 3,
        "image": "img/mie.jpg",
        "description": "Spicy noodle dish from Aceh, made with thick yellow noodles stir-fried or served in broth with beef, seafood, or goat meat. Rich in spices like cardamom and star anise, It is known for its bold, curry-like flavors and vibrant color.",
        "ingredients": "Mie (egg noodles or yellow noodles): 400g;\nBeef or mutton (cut into small pieces): 300g;\nShrimp (optional): 150g;\nShallots: 6, thinly sliced;\nGarlic: 4 cloves, minced;\nRed chili peppers: 3, sliced;\nCurry powder (or Mie Aceh spice mix): 2 tbsp;\nTurmeric powder: 1 tsp;\nCoriander powder: 1 tbsp;\nLemongrass: 1 stalk, bruised;\nKaffir lime leaves: 3;\nCinnamon stick: 1 small piece;\nCardamom pods: 3;\nCloves: 3;\nStar anise: 1;\nTamarind juice: 2 tbsp;\nWater or beef broth: 500 ml;\nCooking oil: 3 tbsp;\nSalt: to taste;\nSugar: 1 tsp;\nSpring onions: 2, sliced;\nFried shallots: for garnish;\nLime wedges: to serve;\nCucumber slices: to serve",
        "instructions": "Heat oil in a large pan over medium heat; Add shallots, garlic, and red chili; sauté until fragrant and golden;\nAdd beef or mutton pieces and stir-fry until they start to brown;\nAdd curry powder, turmeric, coriander powder, cinnamon stick, cardamom, cloves, star anise, and lemongrass; stir well to coat the meat with spices;\nPour in water or beef broth; add kaffir lime leaves and tamarind juice; bring to a boil;\nLower heat and simmer for 30-40 minutes until meat is tender and the broth is flavorful;\nAdd shrimp if using, and cook for another 5 minutes until shrimp turns pink;\nMeanwhile, boil the noodles in salted water until just cooked; drain and set aside;\nRemove the lemongrass and whole spices from the broth; adjust seasoning with salt and sugar;\nAdd cooked noodles into the broth; toss gently to combine and heat through;\nServe hot garnished with sliced spring onions and fried shallots; accompany with lime wedges and cucumber slices on the side;\n"
    }
]